{"Ability: $missing_ability$": 0, "Ability: <noability>": 1, "Ability: Adaptability": 2, "Ability: Aftermath": 3, "Ability: Air Lock": 4, "Ability: Anger Point": 5, "Ability: Anticipation": 6, "Ability: Arena Trap": 7, "Ability: Bad Dreams": 8, "Ability: Battle Armor": 9, "Ability: Blaze": 10, "Ability: Chlorophyll": 11, "Ability: Clear Body": 12, "Ability: Cloud Nine": 13, "Ability: Color Change": 14, "Ability: Compound Eyes": 15, "Ability: Cute Charm": 16, "Ability: Damp": 17, "Ability: Download": 18, "Ability: Drizzle": 19, "Ability: Drought": 20, "Ability: Dry Skin": 21, "Ability: Early Bird": 22, "Ability: Effect Spore": 23, "Ability: Filter": 24, "Ability: Flame Body": 25, "Ability: Flash Fire": 26, "Ability: Flower Gift": 27, "Ability: Forecast": 28, "Ability: Forewarn": 29, "Ability: Frisk": 30, "Ability: Gluttony": 31, "Ability: Guts": 32, "Ability: Heatproof": 33, "Ability: Honey Gather": 34, "Ability: Huge Power": 35, "Ability: Hustle": 36, "Ability: Hydration": 37, "Ability: Hyper Cutter": 38, "Ability: Ice Body": 39, "Ability: Illuminate": 40, "Ability: Immunity": 41, "Ability: Inner Focus": 42, "Ability: Insomnia": 43, "Ability: Intimidate": 44, "Ability: Iron Fist": 45, "Ability: Keen Eye": 46, "Ability: Klutz": 47, "Ability: Leaf Guard": 48, "Ability: Levitate": 49, "Ability: Lightning Rod": 50, "Ability: Limber": 51, "Ability: Liquid Ooze": 52, "Ability: Magic Guard": 53, "Ability: Magma Armor": 54, "Ability: Magnet Pull": 55, "Ability: Marvel Scale": 56, "Ability: Minus": 57, "Ability: Mold Breaker": 58, "Ability: Motor Drive": 59, "Ability: Moxie": 60, "Ability: Multitype": 61, "Ability: Natural Cure": 62, "Ability: No Guard": 63, "Ability: Normalize": 64, "Ability: Oblivious": 65, "Ability: Overgrow": 66, "Ability: Own Tempo": 67, "Ability: Pickup": 68, "Ability: Plus": 69, "Ability: Poison Heal": 70, "Ability: Poison Point": 71, "Ability: Pressure": 72, "Ability: Pure Power": 73, "Ability: Quick Feet": 74, "Ability: Rain Dish": 75, "Ability: Reckless": 76, "Ability: Rivalry": 77, "Ability: Rock Head": 78, "Ability: Rough Skin": 79, "Ability: Run Away": 80, "Ability: Sand Stream": 81, "Ability: Sand Veil": 82, "Ability: Scrappy": 83, "Ability: Serene Grace": 84, "Ability: Shadow Tag": 85, "Ability: Shed Skin": 86, "Ability: Shell Armor": 87, "Ability: Shield Dust": 88, "Ability: Simple": 89, "Ability: Skill Link": 90, "Ability: Slow Start": 91, "Ability: Sniper": 92, "Ability: Snow Cloak": 93, "Ability: Snow Warning": 94, "Ability: Solar Power": 95, "Ability: Solid Rock": 96, "Ability: Soundproof": 97, "Ability: Speed Boost": 98, "Ability: Stall": 99, "Ability: Static": 100, "Ability: Steadfast": 101, "Ability: Stench": 102, "Ability: Sticky Hold": 103, "Ability: Storm Drain": 104, "Ability: Sturdy": 105, "Ability: Suction Cups": 106, "Ability: Super Luck": 107, "Ability: Swarm": 108, "Ability: Swift Swim": 109, "Ability: Synchronize": 110, "Ability: Tangled Feet": 111, "Ability: Technician": 112, "Ability: Thick Fat": 113, "Ability: Tinted Lens": 114, "Ability: Torrent": 115, "Ability: Trace": 116, "Ability: Truant": 117, "Ability: Unaware": 118, "Ability: Unburden": 119, "Ability: Vital Spirit": 120, "Ability: Volt Absorb": 121, "Ability: Water Absorb": 122, "Ability: Water Veil": 123, "Ability: White Smoke": 124, "Ability: Wonder Guard": 125, "EV: $missing_ev$": 126, "Format: gen1nu": 127, "Format: gen1ou": 128, "Format: gen1ubers": 129, "Format: gen1uu": 130, "Format: gen2nu": 131, "Format: gen2ou": 132, "Format: gen2ubers": 133, "Format: gen2uu": 134, "Format: gen3nu": 135, "Format: gen3ou": 136, "Format: gen3ubers": 137, "Format: gen3uu": 138, "Format: gen4nu": 139, "Format: gen4ou": 140, "Format: gen4ubers": 141, "Format: gen4uu": 142, "IV: $missing_iv$": 143, "Item: $missing_item$": 144, "Item: <noitem>": 145, "Item: Adamant Orb": 146, "Item: Aguav Berry": 147, "Item: Apicot Berry": 148, "Item: Armor Fossil": 149, "Item: Aspear Berry": 150, "Item: Babiri Berry": 151, "Item: Belue Berry": 152, "Item: Berry": 153, "Item: Berry Juice": 154, "Item: Berserk Gene": 155, "Item: Big Root": 156, "Item: Bitter Berry": 157, "Item: Black Belt": 158, "Item: Black Glasses": 159, "Item: Black Sludge": 160, "Item: Bluk Berry": 161, "Item: Bright Powder": 162, "Item: BrightPowder": 163, "Item: Burnt Berry": 164, "Item: Charcoal": 165, "Item: Charizardite X": 166, "Item: Charti Berry": 167, "Item: Cheri Berry": 168, "Item: Cherish Ball": 169, "Item: Chesto Berry": 170, "Item: Chilan Berry": 171, "Item: Choice Band": 172, "Item: Choice Scarf": 173, "Item: Choice Specs": 174, "Item: Chople Berry": 175, "Item: Claw Fossil": 176, "Item: Coba Berry": 177, "Item: Colbur Berry": 178, "Item: Cornn Berry": 179, "Item: Custap Berry": 180, "Item: Damp Rock": 181, "Item: Deep Sea Scale": 182, "Item: Deep Sea Tooth": 183, "Item: DeepSeaScale": 184, "Item: DeepSeaTooth": 185, "Item: Destiny Knot": 186, "Item: Dive Ball": 187, "Item: Dome Fossil": 188, "Item: Draco Plate": 189, "Item: Dragon Fang": 190, "Item: Dragon Scale": 191, "Item: Dread Plate": 192, "Item: Dubious Disc": 193, "Item: Durin Berry": 194, "Item: Dusk Ball": 195, "Item: Dusk Stone": 196, "Item: Earth Plate": 197, "Item: Electirizer": 198, "Item: Energy Powder": 199, "Item: EnergyPowder": 200, "Item: Enigma Berry": 201, "Item: Expert Belt": 202, "Item: Fast Ball": 203, "Item: Figy Berry": 204, "Item: Fire Stone": 205, "Item: Fist Plate": 206, "Item: Flame Orb": 207, "Item: Flame Plate": 208, "Item: Focus Band": 209, "Item: Focus Sash": 210, "Item: Friend Ball": 211, "Item: Full Incense": 212, "Item: Ganlon Berry": 213, "Item: Gold Berry": 214, "Item: Great Ball": 215, "Item: Grepa Berry": 216, "Item: Grip Claw": 217, "Item: Griseous Orb": 218, "Item: Haban Berry": 219, "Item: Hard Stone": 220, "Item: Heal Ball": 221, "Item: Heat Rock": 222, "Item: Heavy Ball": 223, "Item: Helix Fossil": 224, "Item: Iapapa Berry": 225, "Item: Ice Berry": 226, "Item: Icicle Plate": 227, "Item: Icy Rock": 228, "Item: Insect Plate": 229, "Item: Iron Ball": 230, "Item: Iron Plate": 231, "Item: Jaboca Berry": 232, "Item: Kasib Berry": 233, "Item: Kebia Berry": 234, "Item: Kelpsy Berry": 235, "Item: King's Rock": 236, "Item: Lagging Tail": 237, "Item: Lansat Berry": 238, "Item: Lax Incense": 239, "Item: Leaf Stone": 240, "Item: Leftovers": 241, "Item: Leppa Berry": 242, "Item: Level Ball": 243, "Item: Liechi Berry": 244, "Item: Life Orb": 245, "Item: Light Ball": 246, "Item: Light Clay": 247, "Item: Love Ball": 248, "Item: Lucarionite": 249, "Item: Lucky Punch": 250, "Item: Lum Berry": 251, "Item: Lure Ball": 252, "Item: Lustrous Orb": 253, "Item: Luxury Ball": 254, "Item: Macho Brace": 255, "Item: Magmarizer": 256, "Item: Magnet": 257, "Item: Mago Berry": 258, "Item: Magost Berry": 259, "Item: Mail": 260, "Item: Master Ball": 261, "Item: Meadow Plate": 262, "Item: Mental Herb": 263, "Item: Metal Coat": 264, "Item: Metal Powder": 265, "Item: Metronome": 266, "Item: Micle Berry": 267, "Item: Mind Plate": 268, "Item: Mint Berry": 269, "Item: Miracle Berry": 270, "Item: Miracle Seed": 271, "Item: Moon Ball": 272, "Item: Moon Stone": 273, "Item: Muscle Band": 274, "Item: Mystery Berry": 275, "Item: Mystic Water": 276, "Item: Nanab Berry": 277, "Item: Nest Ball": 278, "Item: Net Ball": 279, "Item: Never-Melt Ice": 280, "Item: Nomel Berry": 281, "Item: Normal Gem": 282, "Item: Occa Berry": 283, "Item: Odd Incense": 284, "Item: Old Amber": 285, "Item: Oran Berry": 286, "Item: Other": 287, "Item: Oval Stone": 288, "Item: PRZ Cure Berry": 289, "Item: PSN Cure Berry": 290, "Item: Pamtre Berry": 291, "Item: Park Ball": 292, "Item: Passho Berry": 293, "Item: Payapa Berry": 294, "Item: Pecha Berry": 295, "Item: Persim Berry": 296, "Item: Petaya Berry": 297, "Item: Pinap Berry": 298, "Item: Pink Bow": 299, "Item: Poison Barb": 300, "Item: Poke Ball": 301, "Item: Polkadot Bow": 302, "Item: Pomeg Berry": 303, "Item: Power Anklet": 304, "Item: Power Band": 305, "Item: Power Belt": 306, "Item: Power Bracer": 307, "Item: Power Herb": 308, "Item: Power Lens": 309, "Item: Power Weight": 310, "Item: Premier Ball": 311, "Item: Qualot Berry": 312, "Item: Quick Ball": 313, "Item: Quick Claw": 314, "Item: Quick Powder": 315, "Item: Rabuta Berry": 316, "Item: Rare Bone": 317, "Item: Rawst Berry": 318, "Item: Razor Claw": 319, "Item: Razor Fang": 320, "Item: Razz Berry": 321, "Item: Repeat Ball": 322, "Item: Rindo Berry": 323, "Item: Rock Incense": 324, "Item: Root Fossil": 325, "Item: Rose Incense": 326, "Item: Rowap Berry": 327, "Item: Safari Ball": 328, "Item: Salac Berry": 329, "Item: Scope Lens": 330, "Item: Sea Incense": 331, "Item: Sharp Beak": 332, "Item: Shed Shell": 333, "Item: Shell Bell": 334, "Item: Shiny Stone": 335, "Item: Shuca Berry": 336, "Item: Silk Scarf": 337, "Item: Silver Powder": 338, "Item: SilverPowder": 339, "Item: Sitrus Berry": 340, "Item: Skull Fossil": 341, "Item: Sky Plate": 342, "Item: Smooth Rock": 343, "Item: Soft Sand": 344, "Item: Soul Dew": 345, "Item: Spell Tag": 346, "Item: Spelon Berry": 347, "Item: Splash Plate": 348, "Item: Spooky Plate": 349, "Item: Sport Ball": 350, "Item: Starf Berry": 351, "Item: Stick": 352, "Item: Sticky Barb": 353, "Item: Stone Plate": 354, "Item: Sun Stone": 355, "Item: Tamato Berry": 356, "Item: Tanga Berry": 357, "Item: Thick Club": 358, "Item: Thunder Stone": 359, "Item: Timer Ball": 360, "Item: Toxic Orb": 361, "Item: Toxic Plate": 362, "Item: Twisted Spoon": 363, "Item: TwistedSpoon": 364, "Item: Ultra Ball": 365, "Item: Up-Grade": 366, "Item: Wacan Berry": 367, "Item: Water Stone": 368, "Item: Watmel Berry": 369, "Item: Wave Incense": 370, "Item: Wepear Berry": 371, "Item: White Herb": 372, "Item: Wide Lens": 373, "Item: Wiki Berry": 374, "Item: Wise Glasses": 375, "Item: Yache Berry": 376, "Item: Zap Plate": 377, "Item: Zoom Lens": 378, "Mon: $missing_name$": 379, "Mon: Abomasnow": 380, "Mon: Abra": 381, "Mon: Absol": 382, "Mon: Aerodactyl": 383, "Mon: Aggron": 384, "Mon: Aipom": 385, "Mon: Alakazam": 386, "Mon: Altaria": 387, "Mon: Ambipom": 388, "Mon: Ampharos": 389, "Mon: Anorith": 390, "Mon: Arbok": 391, "Mon: Arcanine": 392, "Mon: Arceus": 393, "Mon: Arceus-Bug": 394, "Mon: Arceus-Dark": 395, "Mon: Arceus-Dragon": 396, "Mon: Arceus-Electric": 397, "Mon: Arceus-Fighting": 398, "Mon: Arceus-Fire": 399, "Mon: Arceus-Flying": 400, "Mon: Arceus-Ghost": 401, "Mon: Arceus-Grass": 402, "Mon: Arceus-Ground": 403, "Mon: Arceus-Ice": 404, "Mon: Arceus-Poison": 405, "Mon: Arceus-Psychic": 406, "Mon: Arceus-Rock": 407, "Mon: Arceus-Steel": 408, "Mon: Arceus-Water": 409, "Mon: Ariados": 410, "Mon: Armaldo": 411, "Mon: Aron": 412, "Mon: Articuno": 413, "Mon: Azelf": 414, "Mon: Azumarill": 415, "Mon: Azurill": 416, "Mon: Bagon": 417, "Mon: Baltoy": 418, "Mon: Banette": 419, "Mon: Barboach": 420, "Mon: Bastiodon": 421, "Mon: Bayleef": 422, "Mon: Beautifly": 423, "Mon: Beedrill": 424, "Mon: Beldum": 425, "Mon: Bellossom": 426, "Mon: Bellsprout": 427, "Mon: Bibarel": 428, "Mon: Bidoof": 429, "Mon: Blastoise": 430, "Mon: Blaziken": 431, "Mon: Blissey": 432, "Mon: Bonsly": 433, "Mon: Breloom": 434, "Mon: Bronzong": 435, "Mon: Bronzor": 436, "Mon: Budew": 437, "Mon: Buizel": 438, "Mon: Bulbasaur": 439, "Mon: Buneary": 440, "Mon: Burmy": 441, "Mon: Butterfree": 442, "Mon: Cacnea": 443, "Mon: Cacturne": 444, "Mon: Camerupt": 445, "Mon: Carnivine": 446, "Mon: Carvanha": 447, "Mon: Cascoon": 448, "Mon: Castform": 449, "Mon: Caterpie": 450, "Mon: Celebi": 451, "Mon: Chansey": 452, "Mon: Charizard": 453, "Mon: Charmander": 454, "Mon: Charmeleon": 455, "Mon: Chatot": 456, "Mon: Cherrim": 457, "Mon: Cherubi": 458, "Mon: Chikorita": 459, "Mon: Chimchar": 460, "Mon: Chimecho": 461, "Mon: Chinchou": 462, "Mon: Chingling": 463, "Mon: Clamperl": 464, "Mon: Claydol": 465, "Mon: Clefable": 466, "Mon: Clefairy": 467, "Mon: Cleffa": 468, "Mon: Cloyster": 469, "Mon: Combee": 470, "Mon: Combusken": 471, "Mon: Corphish": 472, "Mon: Corsola": 473, "Mon: Cradily": 474, "Mon: Cranidos": 475, "Mon: Crawdaunt": 476, "Mon: Cresselia": 477, "Mon: Croagunk": 478, "Mon: Crobat": 479, "Mon: Croconaw": 480, "Mon: Cubone": 481, "Mon: Cyndaquil": 482, "Mon: Darkrai": 483, "Mon: Delcatty": 484, "Mon: Delibird": 485, "Mon: Deoxys": 486, "Mon: Deoxys-Attack": 487, "Mon: Deoxys-Defense": 488, "Mon: Deoxys-Speed": 489, "Mon: Dewgong": 490, "Mon: Dialga": 491, "Mon: Diglett": 492, "Mon: Ditto": 493, "Mon: Dodrio": 494, "Mon: Doduo": 495, "Mon: Donphan": 496, "Mon: Dragonair": 497, "Mon: Dragonite": 498, "Mon: Drapion": 499, "Mon: Dratini": 500, "Mon: Drifblim": 501, "Mon: Drifloon": 502, "Mon: Drowzee": 503, "Mon: Dugtrio": 504, "Mon: Dunsparce": 505, "Mon: Dusclops": 506, "Mon: Dusknoir": 507, "Mon: Duskull": 508, "Mon: Dustox": 509, "Mon: Eevee": 510, "Mon: Ekans": 511, "Mon: Electabuzz": 512, "Mon: Electivire": 513, "Mon: Electrike": 514, "Mon: Electrode": 515, "Mon: Elekid": 516, "Mon: Empoleon": 517, "Mon: Entei": 518, "Mon: Espeon": 519, "Mon: Exeggcute": 520, "Mon: Exeggutor": 521, "Mon: Exploud": 522, "Mon: Farfetch'd": 523, "Mon: Fearow": 524, "Mon: Feebas": 525, "Mon: Feraligatr": 526, "Mon: Finneon": 527, "Mon: Flaaffy": 528, "Mon: Flareon": 529, "Mon: Floatzel": 530, "Mon: Flygon": 531, "Mon: Forretress": 532, "Mon: Froslass": 533, "Mon: Furret": 534, "Mon: Gabite": 535, "Mon: Gallade": 536, "Mon: Garchomp": 537, "Mon: Gardevoir": 538, "Mon: Gastly": 539, "Mon: Gastrodon": 540, "Mon: Gengar": 541, "Mon: Geodude": 542, "Mon: Gible": 543, "Mon: Girafarig": 544, "Mon: Giratina": 545, "Mon: Giratina-Origin": 546, "Mon: Glaceon": 547, "Mon: Glalie": 548, "Mon: Glameow": 549, "Mon: Gligar": 550, "Mon: Gliscor": 551, "Mon: Gloom": 552, "Mon: Golbat": 553, "Mon: Goldeen": 554, "Mon: Golduck": 555, "Mon: Golem": 556, "Mon: Gorebyss": 557, "Mon: Granbull": 558, "Mon: Graveler": 559, "Mon: Grimer": 560, "Mon: Grotle": 561, "Mon: Groudon": 562, "Mon: Grovyle": 563, "Mon: Growlithe": 564, "Mon: Grumpig": 565, "Mon: Gulpin": 566, "Mon: Gyarados": 567, "Mon: Happiny": 568, "Mon: Hariyama": 569, "Mon: Haunter": 570, "Mon: Heatran": 571, "Mon: Heracross": 572, "Mon: Hippopotas": 573, "Mon: Hippowdon": 574, "Mon: Hitmonchan": 575, "Mon: Hitmonlee": 576, "Mon: Hitmontop": 577, "Mon: Ho-Oh": 578, "Mon: Honchkrow": 579, "Mon: Hoothoot": 580, "Mon: Hoppip": 581, "Mon: Horsea": 582, "Mon: Houndoom": 583, "Mon: Houndour": 584, "Mon: Huntail": 585, "Mon: Hypno": 586, "Mon: Igglybuff": 587, "Mon: Illumise": 588, "Mon: Infernape": 589, "Mon: Ivysaur": 590, "Mon: Jigglypuff": 591, "Mon: Jirachi": 592, "Mon: Jolteon": 593, "Mon: Jumpluff": 594, "Mon: Jynx": 595, "Mon: Kabuto": 596, "Mon: Kabutops": 597, "Mon: Kadabra": 598, "Mon: Kakuna": 599, "Mon: Kangaskhan": 600, "Mon: Kecleon": 601, "Mon: Kingdra": 602, "Mon: Kingler": 603, "Mon: Kirlia": 604, "Mon: Koffing": 605, "Mon: Krabby": 606, "Mon: Kricketot": 607, "Mon: Kricketune": 608, "Mon: Kyogre": 609, "Mon: Lairon": 610, "Mon: Lanturn": 611, "Mon: Lapras": 612, "Mon: Larvitar": 613, "Mon: Latias": 614, "Mon: Latios": 615, "Mon: Leafeon": 616, "Mon: Ledian": 617, "Mon: Ledyba": 618, "Mon: Lickilicky": 619, "Mon: Lickitung": 620, "Mon: Lileep": 621, "Mon: Linoone": 622, "Mon: Lombre": 623, "Mon: Lopunny": 624, "Mon: Lotad": 625, "Mon: Loudred": 626, "Mon: Lucario": 627, "Mon: Ludicolo": 628, "Mon: Lugia": 629, "Mon: Lumineon": 630, "Mon: Lunatone": 631, "Mon: Luvdisc": 632, "Mon: Luxio": 633, "Mon: Luxray": 634, "Mon: Machamp": 635, "Mon: Machoke": 636, "Mon: Machop": 637, "Mon: Magby": 638, "Mon: Magcargo": 639, "Mon: Magikarp": 640, "Mon: Magmar": 641, "Mon: Magmortar": 642, "Mon: Magnemite": 643, "Mon: Magneton": 644, "Mon: Magnezone": 645, "Mon: Makuhita": 646, "Mon: Mamoswine": 647, "Mon: Manaphy": 648, "Mon: Manectric": 649, "Mon: Mankey": 650, "Mon: Mantine": 651, "Mon: Mantyke": 652, "Mon: Mareep": 653, "Mon: Marill": 654, "Mon: Marowak": 655, "Mon: Marshtomp": 656, "Mon: Masquerain": 657, "Mon: Mawile": 658, "Mon: Medicham": 659, "Mon: Meditite": 660, "Mon: Meganium": 661, "Mon: Meowth": 662, "Mon: Mesprit": 663, "Mon: Metagross": 664, "Mon: Metang": 665, "Mon: Metapod": 666, "Mon: Mew": 667, "Mon: Mewtwo": 668, "Mon: Mightyena": 669, "Mon: Milotic": 670, "Mon: Miltank": 671, "Mon: Mime Jr.": 672, "Mon: Minun": 673, "Mon: Misdreavus": 674, "Mon: Mismagius": 675, "Mon: Moltres": 676, "Mon: Monferno": 677, "Mon: Mothim": 678, "Mon: Mr. Mime": 679, "Mon: Mudkip": 680, "Mon: Muk": 681, "Mon: Munchlax": 682, "Mon: Murkrow": 683, "Mon: Natu": 684, "Mon: Nidoking": 685, "Mon: Nidoqueen": 686, "Mon: NidoranF": 687, "Mon: NidoranM": 688, "Mon: Nidorina": 689, "Mon: Nidorino": 690, "Mon: Nincada": 691, "Mon: Ninetales": 692, "Mon: Ninjask": 693, "Mon: Noctowl": 694, "Mon: Nosepass": 695, "Mon: Numel": 696, "Mon: Nuzleaf": 697, "Mon: Octillery": 698, "Mon: Oddish": 699, "Mon: Omanyte": 700, "Mon: Omastar": 701, "Mon: Onix": 702, "Mon: Pachirisu": 703, "Mon: Palkia": 704, "Mon: Paras": 705, "Mon: Parasect": 706, "Mon: Pelipper": 707, "Mon: Persian": 708, "Mon: Phanpy": 709, "Mon: Phione": 710, "Mon: Pichu": 711, "Mon: Pidgeot": 712, "Mon: Pidgeotto": 713, "Mon: Pidgey": 714, "Mon: Pikachu": 715, "Mon: Piloswine": 716, "Mon: Pineco": 717, "Mon: Pinsir": 718, "Mon: Piplup": 719, "Mon: Plusle": 720, "Mon: Politoed": 721, "Mon: Poliwag": 722, "Mon: Poliwhirl": 723, "Mon: Poliwrath": 724, "Mon: Ponyta": 725, "Mon: Poochyena": 726, "Mon: Porygon": 727, "Mon: Porygon-Z": 728, "Mon: Porygon2": 729, "Mon: Primeape": 730, "Mon: Prinplup": 731, "Mon: Probopass": 732, "Mon: Psyduck": 733, "Mon: Pupitar": 734, "Mon: Purugly": 735, "Mon: Quagsire": 736, "Mon: Quilava": 737, "Mon: Qwilfish": 738, "Mon: Raichu": 739, "Mon: Raikou": 740, "Mon: Ralts": 741, "Mon: Rampardos": 742, "Mon: Rapidash": 743, "Mon: Raticate": 744, "Mon: Rattata": 745, "Mon: Rayquaza": 746, "Mon: Regice": 747, "Mon: Regigigas": 748, "Mon: Regirock": 749, "Mon: Registeel": 750, "Mon: Relicanth": 751, "Mon: Remoraid": 752, "Mon: Rhydon": 753, "Mon: Rhyhorn": 754, "Mon: Rhyperior": 755, "Mon: Riolu": 756, "Mon: Roselia": 757, "Mon: Roserade": 758, "Mon: Rotom": 759, "Mon: Rotom-Fan": 760, "Mon: Rotom-Frost": 761, "Mon: Rotom-Heat": 762, "Mon: Rotom-Mow": 763, "Mon: Rotom-Wash": 764, "Mon: Sableye": 765, "Mon: Salamence": 766, "Mon: Sandshrew": 767, "Mon: Sandslash": 768, "Mon: Sceptile": 769, "Mon: Scizor": 770, "Mon: Scyther": 771, "Mon: Seadra": 772, "Mon: Seaking": 773, "Mon: Sealeo": 774, "Mon: Seedot": 775, "Mon: Seel": 776, "Mon: Sentret": 777, "Mon: Seviper": 778, "Mon: Sharpedo": 779, "Mon: Shaymin": 780, "Mon: Shaymin-Sky": 781, "Mon: Shedinja": 782, "Mon: Shelgon": 783, "Mon: Shellder": 784, "Mon: Shellos": 785, "Mon: Shieldon": 786, "Mon: Shiftry": 787, "Mon: Shinx": 788, "Mon: Shroomish": 789, "Mon: Shuckle": 790, "Mon: Shuppet": 791, "Mon: Silcoon": 792, "Mon: Skarmory": 793, "Mon: Skiploom": 794, "Mon: Skitty": 795, "Mon: Skorupi": 796, "Mon: Skuntank": 797, "Mon: Slaking": 798, "Mon: Slakoth": 799, "Mon: Slowbro": 800, "Mon: Slowking": 801, "Mon: Slowpoke": 802, "Mon: Slugma": 803, "Mon: Smeargle": 804, "Mon: Smoochum": 805, "Mon: Sneasel": 806, "Mon: Snorlax": 807, "Mon: Snorunt": 808, "Mon: Snover": 809, "Mon: Snubbull": 810, "Mon: Solrock": 811, "Mon: Spearow": 812, "Mon: Spheal": 813, "Mon: Spinarak": 814, "Mon: Spinda": 815, "Mon: Spiritomb": 816, "Mon: Spoink": 817, "Mon: Squirtle": 818, "Mon: Stantler": 819, "Mon: Staraptor": 820, "Mon: Staravia": 821, "Mon: Starly": 822, "Mon: Starmie": 823, "Mon: Staryu": 824, "Mon: Steelix": 825, "Mon: Stunky": 826, "Mon: Sudowoodo": 827, "Mon: Suicune": 828, "Mon: Sunflora": 829, "Mon: Sunkern": 830, "Mon: Surskit": 831, "Mon: Swablu": 832, "Mon: Swalot": 833, "Mon: Swampert": 834, "Mon: Swellow": 835, "Mon: Swinub": 836, "Mon: Taillow": 837, "Mon: Tangela": 838, "Mon: Tangrowth": 839, "Mon: Tauros": 840, "Mon: Teddiursa": 841, "Mon: Tentacool": 842, "Mon: Tentacruel": 843, "Mon: Togekiss": 844, "Mon: Togepi": 845, "Mon: Togetic": 846, "Mon: Torchic": 847, "Mon: Torkoal": 848, "Mon: Torterra": 849, "Mon: Totodile": 850, "Mon: Toxicroak": 851, "Mon: Trapinch": 852, "Mon: Treecko": 853, "Mon: Tropius": 854, "Mon: Turtwig": 855, "Mon: Typhlosion": 856, "Mon: Tyranitar": 857, "Mon: Tyrogue": 858, "Mon: Umbreon": 859, "Mon: Unown": 860, "Mon: Ursaring": 861, "Mon: Uxie": 862, "Mon: Vaporeon": 863, "Mon: Venomoth": 864, "Mon: Venonat": 865, "Mon: Venusaur": 866, "Mon: Vespiquen": 867, "Mon: Vibrava": 868, "Mon: Victreebel": 869, "Mon: Vigoroth": 870, "Mon: Vileplume": 871, "Mon: Volbeat": 872, "Mon: Voltorb": 873, "Mon: Vulpix": 874, "Mon: Wailmer": 875, "Mon: Wailord": 876, "Mon: Walrein": 877, "Mon: Wartortle": 878, "Mon: Weavile": 879, "Mon: Weedle": 880, "Mon: Weepinbell": 881, "Mon: Weezing": 882, "Mon: Whiscash": 883, "Mon: Whismur": 884, "Mon: Wigglytuff": 885, "Mon: Wingull": 886, "Mon: Wobbuffet": 887, "Mon: Wooper": 888, "Mon: Wormadam": 889, "Mon: Wormadam-Sandy": 890, "Mon: Wormadam-Trash": 891, "Mon: Wurmple": 892, "Mon: Wynaut": 893, "Mon: Xatu": 894, "Mon: Yanma": 895, "Mon: Yanmega": 896, "Mon: Zangoose": 897, "Mon: Zapdos": 898, "Mon: Zigzagoon": 899, "Mon: Zubat": 900, "Move: $missing_move$": 901, "Move: <nomove>": 902, "Move: Absorb": 903, "Move: Acid": 904, "Move: Acid Armor": 905, "Move: Acupressure": 906, "Move: Aerial Ace": 907, "Move: Aeroblast": 908, "Move: Agility": 909, "Move: Air Cutter": 910, "Move: Air Slash": 911, "Move: Amnesia": 912, "Move: Ancient Power": 913, "Move: Aqua Jet": 914, "Move: Aqua Ring": 915, "Move: Aqua Tail": 916, "Move: Arm Thrust": 917, "Move: Aromatherapy": 918, "Move: Assist": 919, "Move: Assurance": 920, "Move: Astonish": 921, "Move: Attack Order": 922, "Move: Attract": 923, "Move: Aura Sphere": 924, "Move: Aurora Beam": 925, "Move: Avalanche": 926, "Move: Barrage": 927, "Move: Barrier": 928, "Move: Baton Pass": 929, "Move: Beat Up": 930, "Move: Belly Drum": 931, "Move: Bide": 932, "Move: Bind": 933, "Move: Bite": 934, "Move: Blast Burn": 935, "Move: Blaze Kick": 936, "Move: Blizzard": 937, "Move: Block": 938, "Move: Body Slam": 939, "Move: Bone Club": 940, "Move: Bone Rush": 941, "Move: Bonemerang": 942, "Move: Bounce": 943, "Move: Brave Bird": 944, "Move: Brick Break": 945, "Move: Brine": 946, "Move: Bubble": 947, "Move: Bubble Beam": 948, "Move: Bug Bite": 949, "Move: Bug Buzz": 950, "Move: Bulk Up": 951, "Move: Bullet Punch": 952, "Move: Bullet Seed": 953, "Move: Calm Mind": 954, "Move: Camouflage": 955, "Move: Captivate": 956, "Move: Charge": 957, "Move: Charge Beam": 958, "Move: Charm": 959, "Move: Chatter": 960, "Move: Clamp": 961, "Move: Close Combat": 962, "Move: Comet Punch": 963, "Move: Confuse Ray": 964, "Move: Confusion": 965, "Move: Constrict": 966, "Move: Conversion": 967, "Move: Conversion 2": 968, "Move: Copycat": 969, "Move: Cosmic Power": 970, "Move: Cotton Spore": 971, "Move: Counter": 972, "Move: Covet": 973, "Move: Crabhammer": 974, "Move: Cross Chop": 975, "Move: Cross Poison": 976, "Move: Crunch": 977, "Move: Crush Claw": 978, "Move: Crush Grip": 979, "Move: Curse": 980, "Move: Cut": 981, "Move: Dark Pulse": 982, "Move: Dark Void": 983, "Move: Dazzling Gleam": 984, "Move: Defend Order": 985, "Move: Defense Curl": 986, "Move: Defog": 987, "Move: Destiny Bond": 988, "Move: Detect": 989, "Move: Dig": 990, "Move: Disable": 991, "Move: Discharge": 992, "Move: Dive": 993, "Move: Dizzy Punch": 994, "Move: Doom Desire": 995, "Move: Double Hit": 996, "Move: Double Kick": 997, "Move: Double Slap": 998, "Move: Double-Edge": 999, "Move: Draco Meteor": 1000, "Move: Dragon Breath": 1001, "Move: Dragon Claw": 1002, "Move: Dragon Dance": 1003, "Move: Dragon Pulse": 1004, "Move: Dragon Rage": 1005, "Move: Dragon Rush": 1006, "Move: Drain Punch": 1007, "Move: Dream Eater": 1008, "Move: Drill Peck": 1009, "Move: Dynamic Punch": 1010, "Move: Earth Power": 1011, "Move: Earthquake": 1012, "Move: Egg Bomb": 1013, "Move: Embargo": 1014, "Move: Ember": 1015, "Move: Encore": 1016, "Move: Endeavor": 1017, "Move: Endure": 1018, "Move: Energy Ball": 1019, "Move: Eruption": 1020, "Move: Explosion": 1021, "Move: Extrasensory": 1022, "Move: Extreme Speed": 1023, "Move: Facade": 1024, "Move: Fake Out": 1025, "Move: Fake Tears": 1026, "Move: False Swipe": 1027, "Move: Feather Dance": 1028, "Move: Feint": 1029, "Move: Feint Attack": 1030, "Move: Fire Blast": 1031, "Move: Fire Fang": 1032, "Move: Fire Punch": 1033, "Move: Fire Spin": 1034, "Move: Fissure": 1035, "Move: Flail": 1036, "Move: Flame Wheel": 1037, "Move: Flamethrower": 1038, "Move: Flare Blitz": 1039, "Move: Flash": 1040, "Move: Flash Cannon": 1041, "Move: Flatter": 1042, "Move: Fling": 1043, "Move: Fly": 1044, "Move: Focus Blast": 1045, "Move: Focus Energy": 1046, "Move: Focus Punch": 1047, "Move: Follow Me": 1048, "Move: Force Palm": 1049, "Move: Foresight": 1050, "Move: Foul Play": 1051, "Move: Frenzy Plant": 1052, "Move: Frustration": 1053, "Move: Fury Attack": 1054, "Move: Fury Cutter": 1055, "Move: Fury Swipes": 1056, "Move: Future Sight": 1057, "Move: Gastro Acid": 1058, "Move: Giga Drain": 1059, "Move: Giga Impact": 1060, "Move: Glare": 1061, "Move: Grass Knot": 1062, "Move: Grass Whistle": 1063, "Move: Gravity": 1064, "Move: Growl": 1065, "Move: Growth": 1066, "Move: Grudge": 1067, "Move: Guard Swap": 1068, "Move: Gunk Shot": 1069, "Move: Gust": 1070, "Move: Gyro Ball": 1071, "Move: Hail": 1072, "Move: Hammer Arm": 1073, "Move: Harden": 1074, "Move: Haze": 1075, "Move: Head Smash": 1076, "Move: Headbutt": 1077, "Move: Heal Bell": 1078, "Move: Heal Block": 1079, "Move: Heal Order": 1080, "Move: Healing Wish": 1081, "Move: Heart Swap": 1082, "Move: Heat Wave": 1083, "Move: Helping Hand": 1084, "Move: Hidden Power": 1085, "Move: High Jump Kick": 1086, "Move: Horn Attack": 1087, "Move: Howl": 1088, "Move: Hydro Cannon": 1089, "Move: Hydro Pump": 1090, "Move: Hyper Beam": 1091, "Move: Hyper Fang": 1092, "Move: Hyper Voice": 1093, "Move: Hypnosis": 1094, "Move: Ice Ball": 1095, "Move: Ice Beam": 1096, "Move: Ice Fang": 1097, "Move: Ice Punch": 1098, "Move: Ice Shard": 1099, "Move: Icicle Spear": 1100, "Move: Icy Wind": 1101, "Move: Imprison": 1102, "Move: Ingrain": 1103, "Move: Iron Defense": 1104, "Move: Iron Head": 1105, "Move: Iron Tail": 1106, "Move: Judgment": 1107, "Move: Jump Kick": 1108, "Move: Karate Chop": 1109, "Move: Kinesis": 1110, "Move: Knock Off": 1111, "Move: Last Resort": 1112, "Move: Lava Plume": 1113, "Move: Leaf Blade": 1114, "Move: Leaf Storm": 1115, "Move: Leech Life": 1116, "Move: Leech Seed": 1117, "Move: Leer": 1118, "Move: Lick": 1119, "Move: Light Screen": 1120, "Move: Lock-On": 1121, "Move: Lovely Kiss": 1122, "Move: Low Kick": 1123, "Move: Lucky Chant": 1124, "Move: Lunar Dance": 1125, "Move: Luster Purge": 1126, "Move: Mach Punch": 1127, "Move: Magic Coat": 1128, "Move: Magical Leaf": 1129, "Move: Magma Storm": 1130, "Move: Magnet Bomb": 1131, "Move: Magnet Rise": 1132, "Move: Magnitude": 1133, "Move: Me First": 1134, "Move: Mean Look": 1135, "Move: Meditate": 1136, "Move: Mega Drain": 1137, "Move: Mega Kick": 1138, "Move: Mega Punch": 1139, "Move: Megahorn": 1140, "Move: Memento": 1141, "Move: Metal Burst": 1142, "Move: Metal Claw": 1143, "Move: Metal Sound": 1144, "Move: Meteor Mash": 1145, "Move: Metronome": 1146, "Move: Milk Drink": 1147, "Move: Mimic": 1148, "Move: Mind Reader": 1149, "Move: Miracle Eye": 1150, "Move: Mirror Coat": 1151, "Move: Mirror Move": 1152, "Move: Mirror Shot": 1153, "Move: Mist": 1154, "Move: Mist Ball": 1155, "Move: Moonlight": 1156, "Move: Morning Sun": 1157, "Move: Mud Bomb": 1158, "Move: Mud Shot": 1159, "Move: Mud Sport": 1160, "Move: Mud-Slap": 1161, "Move: Muddy Water": 1162, "Move: Nasty Plot": 1163, "Move: Natural Gift": 1164, "Move: Nature Power": 1165, "Move: Needle Arm": 1166, "Move: Night Shade": 1167, "Move: Night Slash": 1168, "Move: Nightmare": 1169, "Move: Nothing": 1170, "Move: Octazooka": 1171, "Move: Odor Sleuth": 1172, "Move: Ominous Wind": 1173, "Move: Other": 1174, "Move: Outrage": 1175, "Move: Overheat": 1176, "Move: Pain Split": 1177, "Move: Pay Day": 1178, "Move: Payback": 1179, "Move: Peck": 1180, "Move: Perish Song": 1181, "Move: Petal Dance": 1182, "Move: Pin Missile": 1183, "Move: Pluck": 1184, "Move: Poison Fang": 1185, "Move: Poison Gas": 1186, "Move: Poison Jab": 1187, "Move: Poison Powder": 1188, "Move: Poison Sting": 1189, "Move: Poison Tail": 1190, "Move: Pound": 1191, "Move: Powder Snow": 1192, "Move: Power Gem": 1193, "Move: Power Swap": 1194, "Move: Power Trick": 1195, "Move: Power Whip": 1196, "Move: Power-Up Punch": 1197, "Move: Present": 1198, "Move: Protect": 1199, "Move: Psybeam": 1200, "Move: Psych Up": 1201, "Move: Psychic": 1202, "Move: Psycho Boost": 1203, "Move: Psycho Cut": 1204, "Move: Psycho Shift": 1205, "Move: Psywave": 1206, "Move: Punishment": 1207, "Move: Pursuit": 1208, "Move: Quick Attack": 1209, "Move: Rage": 1210, "Move: Rain Dance": 1211, "Move: Rapid Spin": 1212, "Move: Razor Leaf": 1213, "Move: Razor Wind": 1214, "Move: Recover": 1215, "Move: Recycle": 1216, "Move: Reflect": 1217, "Move: Refresh": 1218, "Move: Rest": 1219, "Move: Return": 1220, "Move: Revenge": 1221, "Move: Reversal": 1222, "Move: Roar": 1223, "Move: Roar of Time": 1224, "Move: Rock Blast": 1225, "Move: Rock Climb": 1226, "Move: Rock Polish": 1227, "Move: Rock Slide": 1228, "Move: Rock Smash": 1229, "Move: Rock Throw": 1230, "Move: Rock Tomb": 1231, "Move: Rock Wrecker": 1232, "Move: Role Play": 1233, "Move: Rolling Kick": 1234, "Move: Rollout": 1235, "Move: Roost": 1236, "Move: Sacred Fire": 1237, "Move: Safeguard": 1238, "Move: Sand Attack": 1239, "Move: Sand Tomb": 1240, "Move: Sandstorm": 1241, "Move: Scary Face": 1242, "Move: Scratch": 1243, "Move: Screech": 1244, "Move: Secret Power": 1245, "Move: Seed Bomb": 1246, "Move: Seed Flare": 1247, "Move: Seismic Toss": 1248, "Move: Self-Destruct": 1249, "Move: Shadow Ball": 1250, "Move: Shadow Claw": 1251, "Move: Shadow Force": 1252, "Move: Shadow Punch": 1253, "Move: Shadow Sneak": 1254, "Move: Sharpen": 1255, "Move: Shock Wave": 1256, "Move: Signal Beam": 1257, "Move: Silver Wind": 1258, "Move: Sing": 1259, "Move: Sketch": 1260, "Move: Skill Swap": 1261, "Move: Skull Bash": 1262, "Move: Sky Attack": 1263, "Move: Sky Uppercut": 1264, "Move: Slack Off": 1265, "Move: Slam": 1266, "Move: Slash": 1267, "Move: Sleep Powder": 1268, "Move: Sleep Talk": 1269, "Move: Sludge": 1270, "Move: Sludge Bomb": 1271, "Move: Smelling Salts": 1272, "Move: Smog": 1273, "Move: Smokescreen": 1274, "Move: Snatch": 1275, "Move: Snore": 1276, "Move: Soft-Boiled": 1277, "Move: Solar Beam": 1278, "Move: Sonic Boom": 1279, "Move: Spacial Rend": 1280, "Move: Spark": 1281, "Move: Spider Web": 1282, "Move: Spike Cannon": 1283, "Move: Spikes": 1284, "Move: Spit Up": 1285, "Move: Spite": 1286, "Move: Splash": 1287, "Move: Spore": 1288, "Move: Stealth Rock": 1289, "Move: Steel Wing": 1290, "Move: Stockpile": 1291, "Move: Stomp": 1292, "Move: Stone Edge": 1293, "Move: Strength": 1294, "Move: String Shot": 1295, "Move: Stun Spore": 1296, "Move: Submission": 1297, "Move: Substitute": 1298, "Move: Sucker Punch": 1299, "Move: Sunny Day": 1300, "Move: Super Fang": 1301, "Move: Superpower": 1302, "Move: Supersonic": 1303, "Move: Surf": 1304, "Move: Swagger": 1305, "Move: Swallow": 1306, "Move: Sweet Kiss": 1307, "Move: Sweet Scent": 1308, "Move: Swift": 1309, "Move: Switcheroo": 1310, "Move: Swords Dance": 1311, "Move: Synthesis": 1312, "Move: Tackle": 1313, "Move: Tail Glow": 1314, "Move: Tail Whip": 1315, "Move: Tailwind": 1316, "Move: Take Down": 1317, "Move: Taunt": 1318, "Move: Teeter Dance": 1319, "Move: Teleport": 1320, "Move: Thief": 1321, "Move: Thrash": 1322, "Move: Thunder": 1323, "Move: Thunder Fang": 1324, "Move: Thunder Punch": 1325, "Move: Thunder Shock": 1326, "Move: Thunder Wave": 1327, "Move: Thunderbolt": 1328, "Move: Tickle": 1329, "Move: Torment": 1330, "Move: Toxic": 1331, "Move: Toxic Spikes": 1332, "Move: Transform": 1333, "Move: Tri Attack": 1334, "Move: Trick": 1335, "Move: Trick Room": 1336, "Move: Triple Kick": 1337, "Move: Trump Card": 1338, "Move: Twineedle": 1339, "Move: Twister": 1340, "Move: U-turn": 1341, "Move: Uproar": 1342, "Move: Vacuum Wave": 1343, "Move: Vice Grip": 1344, "Move: Vine Whip": 1345, "Move: Vise Grip": 1346, "Move: Vital Throw": 1347, "Move: Volt Tackle": 1348, "Move: Wake-Up Slap": 1349, "Move: Water Gun": 1350, "Move: Water Pulse": 1351, "Move: Water Sport": 1352, "Move: Water Spout": 1353, "Move: Waterfall": 1354, "Move: Weather Ball": 1355, "Move: Whirlpool": 1356, "Move: Whirlwind": 1357, "Move: Will-O-Wisp": 1358, "Move: Wing Attack": 1359, "Move: Wish": 1360, "Move: Withdraw": 1361, "Move: Wood Hammer": 1362, "Move: Worry Seed": 1363, "Move: Wrap": 1364, "Move: Wring Out": 1365, "Move: X-Scissor": 1366, "Move: Yawn": 1367, "Move: Zap Cannon": 1368, "Move: Zen Headbutt": 1369, "Nature: $missing_nature$": 1370, "Nature: <nonature>": 1371, "Nature: Adamant": 1372, "Nature: Bashful": 1373, "Nature: Bold": 1374, "Nature: Brave": 1375, "Nature: Calm": 1376, "Nature: Careful": 1377, "Nature: Docile": 1378, "Nature: Gentle": 1379, "Nature: Hardy": 1380, "Nature: Hasty": 1381, "Nature: Impish": 1382, "Nature: Jolly": 1383, "Nature: Lax": 1384, "Nature: Lonely": 1385, "Nature: Mild": 1386, "Nature: Modest": 1387, "Nature: Naive": 1388, "Nature: Naughty": 1389, "Nature: Other": 1390, "Nature: Quiet": 1391, "Nature: Quirky": 1392, "Nature: Rash": 1393, "Nature: Relaxed": 1394, "Nature: Sassy": 1395, "Nature: Serious": 1396, "Nature: Timid": 1397}