{"Ability: $missing_ability$": 0, "Ability: <noability>": 1, "Ability: Adaptability": 2, "Ability: Aerilate": 3, "Ability: Aftermath": 4, "Ability: Air Lock": 5, "Ability: Analytic": 6, "Ability: Anger Point": 7, "Ability: Anger Shell": 8, "Ability: Anticipation": 9, "Ability: Arena Trap": 10, "Ability: Armor Tail": 11, "Ability: Aroma Veil": 12, "Ability: As One (Glastrier)": 13, "Ability: As One (Spectrier)": 14, "Ability: Aura Break": 15, "Ability: Bad Dreams": 16, "Ability: Ball Fetch": 17, "Ability: Battery": 18, "Ability: Battle Armor": 19, "Ability: Battle Bond": 20, "Ability: Beads of Ruin": 21, "Ability: Beast Boost": 22, "Ability: Berserk": 23, "Ability: Big Pecks": 24, "Ability: Blaze": 25, "Ability: Bulletproof": 26, "Ability: Cheek Pouch": 27, "Ability: Chilling Neigh": 28, "Ability: Chlorophyll": 29, "Ability: Clear Body": 30, "Ability: Cloud Nine": 31, "Ability: Color Change": 32, "Ability: Comatose": 33, "Ability: Commander": 34, "Ability: Competitive": 35, "Ability: Compound Eyes": 36, "Ability: Contrary": 37, "Ability: Corrosion": 38, "Ability: Costar": 39, "Ability: Cotton Down": 40, "Ability: Cud Chew": 41, "Ability: Curious Medicine": 42, "Ability: Cursed Body": 43, "Ability: Cute Charm": 44, "Ability: Damp": 45, "Ability: Dancer": 46, "Ability: Dark Aura": 47, "Ability: Dauntless Shield": 48, "Ability: Dazzling": 49, "Ability: Defeatist": 50, "Ability: Defiant": 51, "Ability: Delta Stream": 52, "Ability: Desolate Land": 53, "Ability: Disguise": 54, "Ability: Download": 55, "Ability: Dragon's Maw": 56, "Ability: Drizzle": 57, "Ability: Drought": 58, "Ability: Dry Skin": 59, "Ability: Early Bird": 60, "Ability: Earth Eater": 61, "Ability: Effect Spore": 62, "Ability: Electric Surge": 63, "Ability: Electromorphosis": 64, "Ability: Emergency Exit": 65, "Ability: Fairy Aura": 66, "Ability: Filter": 67, "Ability: Flame Body": 68, "Ability: Flare Boost": 69, "Ability: Flash Fire": 70, "Ability: Flower Gift": 71, "Ability: Flower Veil": 72, "Ability: Fluffy": 73, "Ability: Forecast": 74, "Ability: Forewarn": 75, "Ability: Friend Guard": 76, "Ability: Frisk": 77, "Ability: Full Metal Body": 78, "Ability: Fur Coat": 79, "Ability: Gale Wings": 80, "Ability: Galvanize": 81, "Ability: Gluttony": 82, "Ability: Good as Gold": 83, "Ability: Gooey": 84, "Ability: Gorilla Tactics": 85, "Ability: Grass Pelt": 86, "Ability: Grassy Surge": 87, "Ability: Grim Neigh": 88, "Ability: Guard Dog": 89, "Ability: Gulp Missile": 90, "Ability: Guts": 91, "Ability: Hadron Engine": 92, "Ability: Harvest": 93, "Ability: Healer": 94, "Ability: Heatproof": 95, "Ability: Heavy Metal": 96, "Ability: Honey Gather": 97, "Ability: Hospitality": 98, "Ability: Huge Power": 99, "Ability: Hunger Switch": 100, "Ability: Hustle": 101, "Ability: Hydration": 102, "Ability: Hyper Cutter": 103, "Ability: Ice Body": 104, "Ability: Ice Face": 105, "Ability: Ice Scales": 106, "Ability: Illuminate": 107, "Ability: Illusion": 108, "Ability: Immunity": 109, "Ability: Imposter": 110, "Ability: Infiltrator": 111, "Ability: Innards Out": 112, "Ability: Inner Focus": 113, "Ability: Insomnia": 114, "Ability: Intimidate": 115, "Ability: Intrepid Sword": 116, "Ability: Iron Barbs": 117, "Ability: Iron Fist": 118, "Ability: Justified": 119, "Ability: Keen Eye": 120, "Ability: Klutz": 121, "Ability: Leaf Guard": 122, "Ability: Levitate": 123, "Ability: Libero": 124, "Ability: Light Metal": 125, "Ability: Lightning Rod": 126, "Ability: Limber": 127, "Ability: Lingering Aroma": 128, "Ability: Liquid Ooze": 129, "Ability: Liquid Voice": 130, "Ability: Long Reach": 131, "Ability: Magic Bounce": 132, "Ability: Magic Guard": 133, "Ability: Magician": 134, "Ability: Magma Armor": 135, "Ability: Magnet Pull": 136, "Ability: Marvel Scale": 137, "Ability: Mega Launcher": 138, "Ability: Merciless": 139, "Ability: Mimicry": 140, "Ability: Mind's Eye": 141, "Ability: Minus": 142, "Ability: Mirror Armor": 143, "Ability: Misty Surge": 144, "Ability: Mold Breaker": 145, "Ability: Moody": 146, "Ability: Motor Drive": 147, "Ability: Moxie": 148, "Ability: Multiscale": 149, "Ability: Multitype": 150, "Ability: Mummy": 151, "Ability: Mycelium Might": 152, "Ability: Natural Cure": 153, "Ability: Neutralizing Gas": 154, "Ability: No Guard": 155, "Ability: Normalize": 156, "Ability: Oblivious": 157, "Ability: Opportunist": 158, "Ability: Orichalcum Pulse": 159, "Ability: Overcoat": 160, "Ability: Overgrow": 161, "Ability: Own Tempo": 162, "Ability: Parental Bond": 163, "Ability: Pastel Veil": 164, "Ability: Perish Body": 165, "Ability: Pickpocket": 166, "Ability: Pickup": 167, "Ability: Pixilate": 168, "Ability: Plus": 169, "Ability: Poison Heal": 170, "Ability: Poison Point": 171, "Ability: Poison Puppeteer": 172, "Ability: Poison Touch": 173, "Ability: Power Construct": 174, "Ability: Power Spot": 175, "Ability: Power of Alchemy": 176, "Ability: Prankster": 177, "Ability: Pressure": 178, "Ability: Primordial Sea": 179, "Ability: Prism Armor": 180, "Ability: Propeller Tail": 181, "Ability: Protean": 182, "Ability: Protosynthesis": 183, "Ability: Psychic Surge": 184, "Ability: Punk Rock": 185, "Ability: Pure Power": 186, "Ability: Purifying Salt": 187, "Ability: Quark Drive": 188, "Ability: Queenly Majesty": 189, "Ability: Quick Draw": 190, "Ability: Quick Feet": 191, "Ability: RKS System": 192, "Ability: Rain Dish": 193, "Ability: Rattled": 194, "Ability: Receiver": 195, "Ability: Reckless": 196, "Ability: Refrigerate": 197, "Ability: Regenerator": 198, "Ability: Ripen": 199, "Ability: Rivalry": 200, "Ability: Rock Head": 201, "Ability: Rocky Payload": 202, "Ability: Rough Skin": 203, "Ability: Run Away": 204, "Ability: Sand Force": 205, "Ability: Sand Rush": 206, "Ability: Sand Spit": 207, "Ability: Sand Stream": 208, "Ability: Sand Veil": 209, "Ability: Sap Sipper": 210, "Ability: Schooling": 211, "Ability: Scrappy": 212, "Ability: Screen Cleaner": 213, "Ability: Seed Sower": 214, "Ability: Serene Grace": 215, "Ability: Shadow Shield": 216, "Ability: Shadow Tag": 217, "Ability: Sharpness": 218, "Ability: Shed Skin": 219, "Ability: Sheer Force": 220, "Ability: Shell Armor": 221, "Ability: Shield Dust": 222, "Ability: Shields Down": 223, "Ability: Simple": 224, "Ability: Skill Link": 225, "Ability: Slow Start": 226, "Ability: Slush Rush": 227, "Ability: Sniper": 228, "Ability: Snow Cloak": 229, "Ability: Snow Warning": 230, "Ability: Solar Power": 231, "Ability: Solid Rock": 232, "Ability: Soul-Heart": 233, "Ability: Soundproof": 234, "Ability: Speed Boost": 235, "Ability: Stakeout": 236, "Ability: Stall": 237, "Ability: Stalwart": 238, "Ability: Stamina": 239, "Ability: Stance Change": 240, "Ability: Static": 241, "Ability: Steadfast": 242, "Ability: Steam Engine": 243, "Ability: Steelworker": 244, "Ability: Steely Spirit": 245, "Ability: Stench": 246, "Ability: Sticky Hold": 247, "Ability: Storm Drain": 248, "Ability: Strong Jaw": 249, "Ability: Sturdy": 250, "Ability: Suction Cups": 251, "Ability: Super Luck": 252, "Ability: Supersweet Syrup": 253, "Ability: Supreme Overlord": 254, "Ability: Surge Surfer": 255, "Ability: Swarm": 256, "Ability: Sweet Veil": 257, "Ability: Swift Swim": 258, "Ability: Sword of Ruin": 259, "Ability: Symbiosis": 260, "Ability: Synchronize": 261, "Ability: Tablets of Ruin": 262, "Ability: Tangled Feet": 263, "Ability: Tangling Hair": 264, "Ability: Technician": 265, "Ability: Telepathy": 266, "Ability: Tera Shift": 267, "Ability: Teravolt": 268, "Ability: Thermal Exchange": 269, "Ability: Thick Fat": 270, "Ability: Tinted Lens": 271, "Ability: Torrent": 272, "Ability: Tough Claws": 273, "Ability: Toxic Boost": 274, "Ability: Toxic Chain": 275, "Ability: Toxic Debris": 276, "Ability: Trace": 277, "Ability: Transistor": 278, "Ability: Triage": 279, "Ability: Truant": 280, "Ability: Turboblaze": 281, "Ability: Unaware": 282, "Ability: Unburden": 283, "Ability: Unnerve": 284, "Ability: Unseen Fist": 285, "Ability: Vessel of Ruin": 286, "Ability: Victory Star": 287, "Ability: Vital Spirit": 288, "Ability: Volt Absorb": 289, "Ability: Wandering Spirit": 290, "Ability: Water Absorb": 291, "Ability: Water Bubble": 292, "Ability: Water Compaction": 293, "Ability: Water Veil": 294, "Ability: Weak Armor": 295, "Ability: Well-Baked Body": 296, "Ability: White Smoke": 297, "Ability: Wimp Out": 298, "Ability: Wind Power": 299, "Ability: Wind Rider": 300, "Ability: Wonder Guard": 301, "Ability: Wonder Skin": 302, "Ability: Zen Mode": 303, "Ability: Zero to Hero": 304, "EV: $missing_ev$": 305, "Format: gen1nu": 306, "Format: gen1ou": 307, "Format: gen1ubers": 308, "Format: gen1uu": 309, "Format: gen2nu": 310, "Format: gen2ou": 311, "Format: gen2ubers": 312, "Format: gen2uu": 313, "Format: gen3nu": 314, "Format: gen3ou": 315, "Format: gen3ubers": 316, "Format: gen3uu": 317, "Format: gen4nu": 318, "Format: gen4ou": 319, "Format: gen4ubers": 320, "Format: gen4uu": 321, "Format: gen5nu": 322, "Format: gen5ou": 323, "Format: gen5ubers": 324, "Format: gen5uu": 325, "Format: gen6nu": 326, "Format: gen6ou": 327, "Format: gen6ubers": 328, "Format: gen6uu": 329, "Format: gen7nu": 330, "Format: gen7ou": 331, "Format: gen7ubers": 332, "Format: gen7uu": 333, "Format: gen8nu": 334, "Format: gen8ou": 335, "Format: gen8ubers": 336, "Format: gen8uu": 337, "Format: gen9nu": 338, "Format: gen9ou": 339, "Format: gen9ubers": 340, "Format: gen9uu": 341, "IV: $missing_iv$": 342, "Item: $missing_item$": 343, "Item: <noitem>": 344, "Item: Ability Shield": 345, "Item: Abomasite": 346, "Item: Absolite": 347, "Item: Absorb Bulb": 348, "Item: Adamant Crystal": 349, "Item: Adamant Orb": 350, "Item: Adrenaline Orb": 351, "Item: Aerodactylite": 352, "Item: Aggronite": 353, "Item: Aguav Berry": 354, "Item: Air Balloon": 355, "Item: Alakazite": 356, "Item: Aloraichium Z": 357, "Item: Altarianite": 358, "Item: Ampharosite": 359, "Item: Apicot Berry": 360, "Item: Armor Fossil": 361, "Item: Aspear Berry": 362, "Item: Assault Vest": 363, "Item: Audinite": 364, "Item: Auspicious Armor": 365, "Item: Babiri Berry": 366, "Item: Banettite": 367, "Item: Beast Ball": 368, "Item: Beedrillite": 369, "Item: Belue Berry": 370, "Item: Berry": 371, "Item: Berry Juice": 372, "Item: Berry Sweet": 373, "Item: Berserk Gene": 374, "Item: Big Nugget": 375, "Item: Big Root": 376, "Item: Binding Band": 377, "Item: Bitter Berry": 378, "Item: Black Belt": 379, "Item: Black Glasses": 380, "Item: Black Sludge": 381, "Item: Blastoisinite": 382, "Item: Blazikenite": 383, "Item: Blue Orb": 384, "Item: Bluk Berry": 385, "Item: Blunder Policy": 386, "Item: Booster Energy": 387, "Item: Bottle Cap": 388, "Item: Bright Powder": 389, "Item: BrightPowder": 390, "Item: Bug Gem": 391, "Item: Bug Memory": 392, "Item: Buginium Z": 393, "Item: Burn Drive": 394, "Item: Burnt Berry": 395, "Item: Cameruptite": 396, "Item: Cell Battery": 397, "Item: Charcoal": 398, "Item: Charizardite X": 399, "Item: Charizardite Y": 400, "Item: Charti Berry": 401, "Item: Cheri Berry": 402, "Item: Cherish Ball": 403, "Item: Chesto Berry": 404, "Item: Chilan Berry": 405, "Item: Chill Drive": 406, "Item: Chipped Pot": 407, "Item: Choice Band": 408, "Item: Choice Scarf": 409, "Item: Choice Specs": 410, "Item: Chople Berry": 411, "Item: Claw Fossil": 412, "Item: Clear Amulet": 413, "Item: Clover Sweet": 414, "Item: Coba Berry": 415, "Item: Colbur Berry": 416, "Item: Cornerstone Mask": 417, "Item: Cornn Berry": 418, "Item: Cover Fossil": 419, "Item: Covert Cloak": 420, "Item: Cracked Pot": 421, "Item: Custap Berry": 422, "Item: Damp Rock": 423, "Item: Dark Gem": 424, "Item: Dark Memory": 425, "Item: Darkinium Z": 426, "Item: Dawn Stone": 427, "Item: Decidium Z": 428, "Item: Deep Sea Scale": 429, "Item: Deep Sea Tooth": 430, "Item: DeepSeaScale": 431, "Item: DeepSeaTooth": 432, "Item: Destiny Knot": 433, "Item: Diancite": 434, "Item: Dive Ball": 435, "Item: Dome Fossil": 436, "Item: Douse Drive": 437, "Item: Draco Plate": 438, "Item: Dragon Fang": 439, "Item: Dragon Gem": 440, "Item: Dragon Memory": 441, "Item: Dragon Scale": 442, "Item: Dragonium Z": 443, "Item: Dread Plate": 444, "Item: Dream Ball": 445, "Item: Dubious Disc": 446, "Item: Durin Berry": 447, "Item: Dusk Ball": 448, "Item: Dusk Stone": 449, "Item: Earth Plate": 450, "Item: Eevium Z": 451, "Item: Eject Button": 452, "Item: Eject Pack": 453, "Item: Electirizer": 454, "Item: Electric Gem": 455, "Item: Electric Memory": 456, "Item: Electric Seed": 457, "Item: Electrium Z": 458, "Item: Energy Powder": 459, "Item: EnergyPowder": 460, "Item: Enigma Berry": 461, "Item: Eviolite": 462, "Item: Expert Belt": 463, "Item: Fairium Z": 464, "Item: Fairy Feather": 465, "Item: Fairy Memory": 466, "Item: Fast Ball": 467, "Item: Fighting Gem": 468, "Item: Fighting Memory": 469, "Item: Fightinium Z": 470, "Item: Figy Berry": 471, "Item: Fire Gem": 472, "Item: Fire Memory": 473, "Item: Fire Stone": 474, "Item: Firium Z": 475, "Item: Fist Plate": 476, "Item: Flame Orb": 477, "Item: Flame Plate": 478, "Item: Float Stone": 479, "Item: Flower Sweet": 480, "Item: Flying Gem": 481, "Item: Flying Memory": 482, "Item: Flyinium Z": 483, "Item: Focus Band": 484, "Item: Focus Sash": 485, "Item: Fossilized Bird": 486, "Item: Fossilized Dino": 487, "Item: Fossilized Drake": 488, "Item: Fossilized Fish": 489, "Item: Friend Ball": 490, "Item: Full Incense": 491, "Item: Galarica Cuff": 492, "Item: Galladite": 493, "Item: Ganlon Berry": 494, "Item: Garchompite": 495, "Item: Gardevoirite": 496, "Item: Gengarite": 497, "Item: Ghost Gem": 498, "Item: Ghost Memory": 499, "Item: Ghostium Z": 500, "Item: Glalitite": 501, "Item: Gold Berry": 502, "Item: Gold Bottle Cap": 503, "Item: Grass Gem": 504, "Item: Grass Memory": 505, "Item: Grassium Z": 506, "Item: Grassy Seed": 507, "Item: Great Ball": 508, "Item: Grepa Berry": 509, "Item: Grip Claw": 510, "Item: Griseous Core": 511, "Item: Griseous Orb": 512, "Item: Ground Gem": 513, "Item: Ground Memory": 514, "Item: Groundium Z": 515, "Item: Gyaradosite": 516, "Item: Haban Berry": 517, "Item: Hard Stone": 518, "Item: Heal Ball": 519, "Item: Hearthflame Mask": 520, "Item: Heat Rock": 521, "Item: Heavy Ball": 522, "Item: Heavy-Duty Boots": 523, "Item: Helix Fossil": 524, "Item: Heracronite": 525, "Item: Hondew Berry": 526, "Item: Houndoominite": 527, "Item: Iapapa Berry": 528, "Item: Ice Berry": 529, "Item: Ice Gem": 530, "Item: Ice Memory": 531, "Item: Ice Stone": 532, "Item: Icicle Plate": 533, "Item: Icium Z": 534, "Item: Icy Rock": 535, "Item: Incinium Z": 536, "Item: Insect Plate": 537, "Item: Iron Ball": 538, "Item: Iron Plate": 539, "Item: Jaboca Berry": 540, "Item: Jaw Fossil": 541, "Item: Kangaskhanite": 542, "Item: Kasib Berry": 543, "Item: Kebia Berry": 544, "Item: Kee Berry": 545, "Item: Kelpsy Berry": 546, "Item: King's Rock": 547, "Item: Kommonium Z": 548, "Item: Lagging Tail": 549, "Item: Lansat Berry": 550, "Item: Latiasite": 551, "Item: Latiosite": 552, "Item: Lax Incense": 553, "Item: Leaf Stone": 554, "Item: Leek": 555, "Item: Leftovers": 556, "Item: Leppa Berry": 557, "Item: Level Ball": 558, "Item: Liechi Berry": 559, "Item: Life Orb": 560, "Item: Light Ball": 561, "Item: Light Clay": 562, "Item: Loaded Dice": 563, "Item: Lopunnite": 564, "Item: Love Ball": 565, "Item: Love Sweet": 566, "Item: Lucarionite": 567, "Item: Lucky Punch": 568, "Item: Lum Berry": 569, "Item: Luminous Moss": 570, "Item: Lunalium Z": 571, "Item: Lure Ball": 572, "Item: Lustrous Globe": 573, "Item: Lustrous Orb": 574, "Item: Luxury Ball": 575, "Item: Lycanium Z": 576, "Item: Macho Brace": 577, "Item: Magmarizer": 578, "Item: Magnet": 579, "Item: Mago Berry": 580, "Item: Magost Berry": 581, "Item: Mail": 582, "Item: Malicious Armor": 583, "Item: Manectite": 584, "Item: Maranga Berry": 585, "Item: Marshadium Z": 586, "Item: Master Ball": 587, "Item: Mawilite": 588, "Item: Meadow Plate": 589, "Item: Medichamite": 590, "Item: Mental Herb": 591, "Item: Metagrossite": 592, "Item: Metal Coat": 593, "Item: Metal Powder": 594, "Item: Metronome": 595, "Item: Mewnium Z": 596, "Item: Mewtwonite X": 597, "Item: Mewtwonite Y": 598, "Item: Micle Berry": 599, "Item: Mimikium Z": 600, "Item: Mind Plate": 601, "Item: Mint Berry": 602, "Item: Miracle Berry": 603, "Item: Miracle Seed": 604, "Item: Mirror Herb": 605, "Item: Misty Seed": 606, "Item: Moon Ball": 607, "Item: Moon Stone": 608, "Item: Muscle Band": 609, "Item: Mystery Berry": 610, "Item: Mystic Water": 611, "Item: Nanab Berry": 612, "Item: Nest Ball": 613, "Item: Net Ball": 614, "Item: Never-Melt Ice": 615, "Item: Nomel Berry": 616, "Item: Normal Gem": 617, "Item: Normalium Z": 618, "Item: Occa Berry": 619, "Item: Odd Incense": 620, "Item: Old Amber": 621, "Item: Oran Berry": 622, "Item: Other": 623, "Item: Oval Stone": 624, "Item: PRZ Cure Berry": 625, "Item: PSN Cure Berry": 626, "Item: Pamtre Berry": 627, "Item: Park Ball": 628, "Item: Passho Berry": 629, "Item: Payapa Berry": 630, "Item: Pecha Berry": 631, "Item: Persim Berry": 632, "Item: Petaya Berry": 633, "Item: Pidgeotite": 634, "Item: Pikanium Z": 635, "Item: Pikashunium Z": 636, "Item: Pinap Berry": 637, "Item: Pink Bow": 638, "Item: Pinsirite": 639, "Item: Pixie Plate": 640, "Item: Plume Fossil": 641, "Item: Poison Barb": 642, "Item: Poison Gem": 643, "Item: Poison Memory": 644, "Item: Poisonium Z": 645, "Item: Poke Ball": 646, "Item: Polkadot Bow": 647, "Item: Pomeg Berry": 648, "Item: Power Anklet": 649, "Item: Power Band": 650, "Item: Power Belt": 651, "Item: Power Bracer": 652, "Item: Power Herb": 653, "Item: Power Lens": 654, "Item: Power Weight": 655, "Item: Premier Ball": 656, "Item: Primarium Z": 657, "Item: Prism Scale": 658, "Item: Protective Pads": 659, "Item: Protector": 660, "Item: Psychic Gem": 661, "Item: Psychic Memory": 662, "Item: Psychic Seed": 663, "Item: Psychium Z": 664, "Item: Punching Glove": 665, "Item: Qualot Berry": 666, "Item: Quick Ball": 667, "Item: Quick Claw": 668, "Item: Quick Powder": 669, "Item: Rabuta Berry": 670, "Item: Rare Bone": 671, "Item: Rawst Berry": 672, "Item: Razor Claw": 673, "Item: Razor Fang": 674, "Item: Razz Berry": 675, "Item: Reaper Cloth": 676, "Item: Red Card": 677, "Item: Red Orb": 678, "Item: Repeat Ball": 679, "Item: Ribbon Sweet": 680, "Item: Rindo Berry": 681, "Item: Ring Target": 682, "Item: Rock Gem": 683, "Item: Rock Incense": 684, "Item: Rock Memory": 685, "Item: Rockium Z": 686, "Item: Rocky Helmet": 687, "Item: Room Service": 688, "Item: Root Fossil": 689, "Item: Rose Incense": 690, "Item: Roseli Berry": 691, "Item: Rowap Berry": 692, "Item: Rusted Shield": 693, "Item: Rusted Sword": 694, "Item: Sablenite": 695, "Item: Sachet": 696, "Item: Safari Ball": 697, "Item: Safety Goggles": 698, "Item: Sail Fossil": 699, "Item: Salac Berry": 700, "Item: Salamencite": 701, "Item: Sceptilite": 702, "Item: Scizorite": 703, "Item: Scope Lens": 704, "Item: Sea Incense": 705, "Item: Sharp Beak": 706, "Item: Sharpedonite": 707, "Item: Shed Shell": 708, "Item: Shell Bell": 709, "Item: Shiny Stone": 710, "Item: Shock Drive": 711, "Item: Shuca Berry": 712, "Item: Silk Scarf": 713, "Item: Silver Powder": 714, "Item: SilverPowder": 715, "Item: Sitrus Berry": 716, "Item: Skull Fossil": 717, "Item: Sky Plate": 718, "Item: Slowbronite": 719, "Item: Smooth Rock": 720, "Item: Snorlium Z": 721, "Item: Snowball": 722, "Item: Soft Sand": 723, "Item: Solganium Z": 724, "Item: Soul Dew": 725, "Item: Spell Tag": 726, "Item: Spelon Berry": 727, "Item: Splash Plate": 728, "Item: Spooky Plate": 729, "Item: Sport Ball": 730, "Item: Star Sweet": 731, "Item: Starf Berry": 732, "Item: Steel Gem": 733, "Item: Steel Memory": 734, "Item: Steelium Z": 735, "Item: Steelixite": 736, "Item: Stick": 737, "Item: Sticky Barb": 738, "Item: Stone Plate": 739, "Item: Strawberry Sweet": 740, "Item: Sun Stone": 741, "Item: Swampertite": 742, "Item: Sweet Apple": 743, "Item: TR00": 744, "Item: TR02": 745, "Item: TR03": 746, "Item: TR04": 747, "Item: TR07": 748, "Item: TR08": 749, "Item: TR09": 750, "Item: TR10": 751, "Item: TR11": 752, "Item: TR13": 753, "Item: TR15": 754, "Item: TR16": 755, "Item: TR17": 756, "Item: TR19": 757, "Item: TR24": 758, "Item: TR28": 759, "Item: TR31": 760, "Item: TR34": 761, "Item: TR36": 762, "Item: TR37": 763, "Item: TR38": 764, "Item: TR42": 765, "Item: TR43": 766, "Item: TR48": 767, "Item: TR54": 768, "Item: TR59": 769, "Item: TR66": 770, "Item: TR67": 771, "Item: TR69": 772, "Item: TR70": 773, "Item: TR71": 774, "Item: TR72": 775, "Item: TR82": 776, "Item: TR85": 777, "Item: TR86": 778, "Item: TR87": 779, "Item: TR89": 780, "Item: TR90": 781, "Item: TR93": 782, "Item: TR94": 783, "Item: TR95": 784, "Item: TR96": 785, "Item: TR97": 786, "Item: TR98": 787, "Item: TR99": 788, "Item: Tamato Berry": 789, "Item: Tanga Berry": 790, "Item: Tapunium Z": 791, "Item: Tart Apple": 792, "Item: Terrain Extender": 793, "Item: Thick Club": 794, "Item: Throat Spray": 795, "Item: Thunder Stone": 796, "Item: Timer Ball": 797, "Item: Toxic Orb": 798, "Item: Toxic Plate": 799, "Item: Twisted Spoon": 800, "Item: TwistedSpoon": 801, "Item: Tyranitarite": 802, "Item: Ultra Ball": 803, "Item: Ultranecrozium Z": 804, "Item: Up-Grade": 805, "Item: Utility Umbrella": 806, "Item: Venusaurite": 807, "Item: Wacan Berry": 808, "Item: Water Gem": 809, "Item: Water Memory": 810, "Item: Water Stone": 811, "Item: Waterium Z": 812, "Item: Watmel Berry": 813, "Item: Wave Incense": 814, "Item: Weakness Policy": 815, "Item: Wellspring Mask": 816, "Item: Wepear Berry": 817, "Item: Whipped Dream": 818, "Item: White Herb": 819, "Item: Wide Lens": 820, "Item: Wiki Berry": 821, "Item: Wise Glasses": 822, "Item: Yache Berry": 823, "Item: Zap Plate": 824, "Item: Zoom Lens": 825, "Mon: $missing_name$": 826, "Mon: Abomasnow": 827, "Mon: Abomasnow-Mega": 828, "Mon: Abra": 829, "Mon: Absol": 830, "Mon: Absol-Mega": 831, "Mon: Accelgor": 832, "Mon: Aegislash": 833, "Mon: Aerodactyl": 834, "Mon: Aerodactyl-Mega": 835, "Mon: Aggron": 836, "Mon: Aggron-Mega": 837, "Mon: Aipom": 838, "Mon: Alakazam": 839, "Mon: Alakazam-Mega": 840, "Mon: Alcremie": 841, "Mon: Alomomola": 842, "Mon: Altaria": 843, "Mon: Altaria-Mega": 844, "Mon: Amaura": 845, "Mon: Ambipom": 846, "Mon: Amoonguss": 847, "Mon: Ampharos": 848, "Mon: Ampharos-Mega": 849, "Mon: Annihilape": 850, "Mon: Anorith": 851, "Mon: Appletun": 852, "Mon: Applin": 853, "Mon: Araquanid": 854, "Mon: Araquanid-Totem": 855, "Mon: Arbok": 856, "Mon: Arboliva": 857, "Mon: Arcanine": 858, "Mon: Arcanine-Hisui": 859, "Mon: Arceus": 860, "Mon: Arceus-Bug": 861, "Mon: Arceus-Dark": 862, "Mon: Arceus-Dragon": 863, "Mon: Arceus-Electric": 864, "Mon: Arceus-Fairy": 865, "Mon: Arceus-Fighting": 866, "Mon: Arceus-Fire": 867, "Mon: Arceus-Flying": 868, "Mon: Arceus-Ghost": 869, "Mon: Arceus-Grass": 870, "Mon: Arceus-Ground": 871, "Mon: Arceus-Ice": 872, "Mon: Arceus-Poison": 873, "Mon: Arceus-Psychic": 874, "Mon: Arceus-Rock": 875, "Mon: Arceus-Steel": 876, "Mon: Arceus-Water": 877, "Mon: Archaludon": 878, "Mon: Archen": 879, "Mon: Archeops": 880, "Mon: Arctibax": 881, "Mon: Arctovish": 882, "Mon: Arctozolt": 883, "Mon: Ariados": 884, "Mon: Armaldo": 885, "Mon: Armarouge": 886, "Mon: Aromatisse": 887, "Mon: Aron": 888, "Mon: Arrokuda": 889, "Mon: Articuno": 890, "Mon: Articuno-Galar": 891, "Mon: Audino": 892, "Mon: Audino-Mega": 893, "Mon: Aurorus": 894, "Mon: Avalugg": 895, "Mon: Avalugg-Hisui": 896, "Mon: Axew": 897, "Mon: Azelf": 898, "Mon: Azumarill": 899, "Mon: Azurill": 900, "Mon: Bagon": 901, "Mon: Baltoy": 902, "Mon: Banette": 903, "Mon: Banette-Mega": 904, "Mon: Barbaracle": 905, "Mon: Barboach": 906, "Mon: Barraskewda": 907, "Mon: Basculegion": 908, "Mon: Basculegion-F": 909, "Mon: Basculin": 910, "Mon: Bastiodon": 911, "Mon: Baxcalibur": 912, "Mon: Bayleef": 913, "Mon: Beartic": 914, "Mon: Beautifly": 915, "Mon: Beedrill": 916, "Mon: Beedrill-Mega": 917, "Mon: Beheeyem": 918, "Mon: Beldum": 919, "Mon: Bellibolt": 920, "Mon: Bellossom": 921, "Mon: Bellsprout": 922, "Mon: Bergmite": 923, "Mon: Bewear": 924, "Mon: Bibarel": 925, "Mon: Bidoof": 926, "Mon: Binacle": 927, "Mon: Bisharp": 928, "Mon: Blacephalon": 929, "Mon: Blastoise": 930, "Mon: Blastoise-Mega": 931, "Mon: Blaziken": 932, "Mon: Blaziken-Mega": 933, "Mon: Blipbug": 934, "Mon: Blissey": 935, "Mon: Blitzle": 936, "Mon: Boldore": 937, "Mon: Boltund": 938, "Mon: Bombirdier": 939, "Mon: Bonsly": 940, "Mon: Bouffalant": 941, "Mon: Bounsweet": 942, "Mon: Braixen": 943, "Mon: Brambleghast": 944, "Mon: Bramblin": 945, "Mon: Braviary": 946, "Mon: Braviary-Hisui": 947, "Mon: Breloom": 948, "Mon: Brionne": 949, "Mon: Bronzong": 950, "Mon: Bronzor": 951, "Mon: Brute Bonnet": 952, "Mon: Bruxish": 953, "Mon: Budew": 954, "Mon: Buizel": 955, "Mon: Bulbasaur": 956, "Mon: Buneary": 957, "Mon: Bunnelby": 958, "Mon: Burmy": 959, "Mon: Butterfree": 960, "Mon: Buzzwole": 961, "Mon: Cacnea": 962, "Mon: Cacturne": 963, "Mon: Calyrex": 964, "Mon: Calyrex-Ice": 965, "Mon: Calyrex-Shadow": 966, "Mon: Camerupt": 967, "Mon: Camerupt-Mega": 968, "Mon: Capsakid": 969, "Mon: Carbink": 970, "Mon: Carkol": 971, "Mon: Carnivine": 972, "Mon: Carracosta": 973, "Mon: Carvanha": 974, "Mon: Cascoon": 975, "Mon: Castform": 976, "Mon: Caterpie": 977, "Mon: Celebi": 978, "Mon: Celesteela": 979, "Mon: Centiskorch": 980, "Mon: Ceruledge": 981, "Mon: Cetitan": 982, "Mon: Cetoddle": 983, "Mon: Chandelure": 984, "Mon: Chansey": 985, "Mon: Charcadet": 986, "Mon: Charizard": 987, "Mon: Charizard-Mega-X": 988, "Mon: Charizard-Mega-Y": 989, "Mon: Charjabug": 990, "Mon: Charmander": 991, "Mon: Charmeleon": 992, "Mon: Chatot": 993, "Mon: Cherrim": 994, "Mon: Cherubi": 995, "Mon: Chesnaught": 996, "Mon: Chespin": 997, "Mon: Chewtle": 998, "Mon: Chi-Yu": 999, "Mon: Chien-Pao": 1000, "Mon: Chikorita": 1001, "Mon: Chimchar": 1002, "Mon: Chimecho": 1003, "Mon: Chinchou": 1004, "Mon: Chingling": 1005, "Mon: Cinccino": 1006, "Mon: Cinderace": 1007, "Mon: Clamperl": 1008, "Mon: Clauncher": 1009, "Mon: Clawitzer": 1010, "Mon: Claydol": 1011, "Mon: Clefable": 1012, "Mon: Clefairy": 1013, "Mon: Cleffa": 1014, "Mon: Clobbopus": 1015, "Mon: Clodsire": 1016, "Mon: Cloyster": 1017, "Mon: Coalossal": 1018, "Mon: Cobalion": 1019, "Mon: Cofagrigus": 1020, "Mon: Combee": 1021, "Mon: Combusken": 1022, "Mon: Comfey": 1023, "Mon: Conkeldurr": 1024, "Mon: Copperajah": 1025, "Mon: Corphish": 1026, "Mon: Corsola": 1027, "Mon: Corsola-Galar": 1028, "Mon: Corviknight": 1029, "Mon: Corvisquire": 1030, "Mon: Cosmoem": 1031, "Mon: Cosmog": 1032, "Mon: Cottonee": 1033, "Mon: Crabominable": 1034, "Mon: Crabrawler": 1035, "Mon: Cradily": 1036, "Mon: Cramorant": 1037, "Mon: Cranidos": 1038, "Mon: Crawdaunt": 1039, "Mon: Cresselia": 1040, "Mon: Croagunk": 1041, "Mon: Crobat": 1042, "Mon: Crocalor": 1043, "Mon: Croconaw": 1044, "Mon: Crustle": 1045, "Mon: Cryogonal": 1046, "Mon: Cubchoo": 1047, "Mon: Cubone": 1048, "Mon: Cufant": 1049, "Mon: Cursola": 1050, "Mon: Cutiefly": 1051, "Mon: Cyclizar": 1052, "Mon: Cyndaquil": 1053, "Mon: Dachsbun": 1054, "Mon: Darkrai": 1055, "Mon: Darmanitan": 1056, "Mon: Darmanitan-Galar": 1057, "Mon: Dartrix": 1058, "Mon: Darumaka": 1059, "Mon: Darumaka-Galar": 1060, "Mon: Decidueye": 1061, "Mon: Decidueye-Hisui": 1062, "Mon: Dedenne": 1063, "Mon: Deerling": 1064, "Mon: Deino": 1065, "Mon: Delcatty": 1066, "Mon: Delibird": 1067, "Mon: Delphox": 1068, "Mon: Deoxys": 1069, "Mon: Deoxys-Attack": 1070, "Mon: Deoxys-Defense": 1071, "Mon: Deoxys-Speed": 1072, "Mon: Dewgong": 1073, "Mon: Dewott": 1074, "Mon: Dewpider": 1075, "Mon: Dhelmise": 1076, "Mon: Dialga": 1077, "Mon: Dialga-Origin": 1078, "Mon: Diancie": 1079, "Mon: Diancie-Mega": 1080, "Mon: Diggersby": 1081, "Mon: Diglett": 1082, "Mon: Diglett-Alola": 1083, "Mon: Dipplin": 1084, "Mon: Ditto": 1085, "Mon: Dodrio": 1086, "Mon: Doduo": 1087, "Mon: Dolliv": 1088, "Mon: Dondozo": 1089, "Mon: Donphan": 1090, "Mon: Dottler": 1091, "Mon: Doublade": 1092, "Mon: Dracovish": 1093, "Mon: Dracozolt": 1094, "Mon: Dragalge": 1095, "Mon: Dragapult": 1096, "Mon: Dragonair": 1097, "Mon: Dragonite": 1098, "Mon: Drakloak": 1099, "Mon: Drampa": 1100, "Mon: Drapion": 1101, "Mon: Dratini": 1102, "Mon: Drednaw": 1103, "Mon: Dreepy": 1104, "Mon: Drifblim": 1105, "Mon: Drifloon": 1106, "Mon: Drilbur": 1107, "Mon: Drizzile": 1108, "Mon: Drowzee": 1109, "Mon: Druddigon": 1110, "Mon: Dubwool": 1111, "Mon: Ducklett": 1112, "Mon: Dudunsparce": 1113, "Mon: Dugtrio": 1114, "Mon: Dugtrio-Alola": 1115, "Mon: Dunsparce": 1116, "Mon: Duosion": 1117, "Mon: Duraludon": 1118, "Mon: Durant": 1119, "Mon: Dusclops": 1120, "Mon: Dusknoir": 1121, "Mon: Duskull": 1122, "Mon: Dustox": 1123, "Mon: Dwebble": 1124, "Mon: Eelektrik": 1125, "Mon: Eelektross": 1126, "Mon: Eevee": 1127, "Mon: Eiscue": 1128, "Mon: Ekans": 1129, "Mon: Eldegoss": 1130, "Mon: Electabuzz": 1131, "Mon: Electivire": 1132, "Mon: Electrike": 1133, "Mon: Electrode": 1134, "Mon: Electrode-Hisui": 1135, "Mon: Elekid": 1136, "Mon: Elgyem": 1137, "Mon: Emboar": 1138, "Mon: Emolga": 1139, "Mon: Empoleon": 1140, "Mon: Enamorus": 1141, "Mon: Enamorus-Therian": 1142, "Mon: Entei": 1143, "Mon: Escavalier": 1144, "Mon: Espathra": 1145, "Mon: Espeon": 1146, "Mon: Espurr": 1147, "Mon: Eternatus": 1148, "Mon: Excadrill": 1149, "Mon: Exeggcute": 1150, "Mon: Exeggutor": 1151, "Mon: Exeggutor-Alola": 1152, "Mon: Exploud": 1153, "Mon: Falinks": 1154, "Mon: Farfetch'd": 1155, "Mon: Farfetch'd-Galar": 1156, "Mon: Farigiraf": 1157, "Mon: Fearow": 1158, "Mon: Feebas": 1159, "Mon: Fennekin": 1160, "Mon: Feraligatr": 1161, "Mon: Ferroseed": 1162, "Mon: Ferrothorn": 1163, "Mon: Fezandipiti": 1164, "Mon: Fidough": 1165, "Mon: Finizen": 1166, "Mon: Finneon": 1167, "Mon: Flaaffy": 1168, "Mon: Flabebe": 1169, "Mon: Flamigo": 1170, "Mon: Flapple": 1171, "Mon: Flareon": 1172, "Mon: Fletchinder": 1173, "Mon: Fletchling": 1174, "Mon: Flittle": 1175, "Mon: Floatzel": 1176, "Mon: Floette": 1177, "Mon: Floragato": 1178, "Mon: Florges": 1179, "Mon: Flutter Mane": 1180, "Mon: Flygon": 1181, "Mon: Fomantis": 1182, "Mon: Foongus": 1183, "Mon: Forretress": 1184, "Mon: Fraxure": 1185, "Mon: Frillish": 1186, "Mon: Froakie": 1187, "Mon: Frogadier": 1188, "Mon: Froslass": 1189, "Mon: Frosmoth": 1190, "Mon: Fuecoco": 1191, "Mon: Furfrou": 1192, "Mon: Furret": 1193, "Mon: Gabite": 1194, "Mon: Gallade": 1195, "Mon: Gallade-Mega": 1196, "Mon: Galvantula": 1197, "Mon: Garbodor": 1198, "Mon: Garchomp": 1199, "Mon: Garchomp-Mega": 1200, "Mon: Gardevoir": 1201, "Mon: Gardevoir-Mega": 1202, "Mon: Garganacl": 1203, "Mon: Gastly": 1204, "Mon: Gastrodon": 1205, "Mon: Genesect": 1206, "Mon: Gengar": 1207, "Mon: Gengar-Mega": 1208, "Mon: Geodude": 1209, "Mon: Geodude-Alola": 1210, "Mon: Gholdengo": 1211, "Mon: Gible": 1212, "Mon: Gigalith": 1213, "Mon: Gimmighoul": 1214, "Mon: Gimmighoul-Roaming": 1215, "Mon: Girafarig": 1216, "Mon: Giratina": 1217, "Mon: Giratina-Origin": 1218, "Mon: Glaceon": 1219, "Mon: Glalie": 1220, "Mon: Glalie-Mega": 1221, "Mon: Glameow": 1222, "Mon: Glastrier": 1223, "Mon: Gligar": 1224, "Mon: Glimmet": 1225, "Mon: Glimmora": 1226, "Mon: Gliscor": 1227, "Mon: Gloom": 1228, "Mon: Gogoat": 1229, "Mon: Golbat": 1230, "Mon: Goldeen": 1231, "Mon: Golduck": 1232, "Mon: Golem": 1233, "Mon: Golem-Alola": 1234, "Mon: Golett": 1235, "Mon: Golisopod": 1236, "Mon: Golurk": 1237, "Mon: Goodra": 1238, "Mon: Goodra-Hisui": 1239, "Mon: Goomy": 1240, "Mon: Gorebyss": 1241, "Mon: Gossifleur": 1242, "Mon: Gothita": 1243, "Mon: Gothitelle": 1244, "Mon: Gothorita": 1245, "Mon: Gouging Fire": 1246, "Mon: Gourgeist": 1247, "Mon: Gourgeist-Large": 1248, "Mon: Gourgeist-Small": 1249, "Mon: Gourgeist-Super": 1250, "Mon: Grafaiai": 1251, "Mon: Granbull": 1252, "Mon: Grapploct": 1253, "Mon: Graveler": 1254, "Mon: Graveler-Alola": 1255, "Mon: Great Tusk": 1256, "Mon: Greavard": 1257, "Mon: Greedent": 1258, "Mon: Greninja": 1259, "Mon: Greninja-Ash": 1260, "Mon: Grimer": 1261, "Mon: Grimer-Alola": 1262, "Mon: Grimmsnarl": 1263, "Mon: Grookey": 1264, "Mon: Grotle": 1265, "Mon: Groudon": 1266, "Mon: Groudon-Primal": 1267, "Mon: Grovyle": 1268, "Mon: Growlithe": 1269, "Mon: Growlithe-Hisui": 1270, "Mon: Grubbin": 1271, "Mon: Grumpig": 1272, "Mon: Gulpin": 1273, "Mon: Gumshoos": 1274, "Mon: Gumshoos-Totem": 1275, "Mon: Gurdurr": 1276, "Mon: Guzzlord": 1277, "Mon: Gyarados": 1278, "Mon: Gyarados-Mega": 1279, "Mon: Hakamo-o": 1280, "Mon: Happiny": 1281, "Mon: Hariyama": 1282, "Mon: Hatenna": 1283, "Mon: Hatterene": 1284, "Mon: Hattrem": 1285, "Mon: Haunter": 1286, "Mon: Hawlucha": 1287, "Mon: Haxorus": 1288, "Mon: Heatmor": 1289, "Mon: Heatran": 1290, "Mon: Heliolisk": 1291, "Mon: Helioptile": 1292, "Mon: Heracross": 1293, "Mon: Heracross-Mega": 1294, "Mon: Herdier": 1295, "Mon: Hippopotas": 1296, "Mon: Hippowdon": 1297, "Mon: Hitmonchan": 1298, "Mon: Hitmonlee": 1299, "Mon: Hitmontop": 1300, "Mon: Ho-Oh": 1301, "Mon: Honchkrow": 1302, "Mon: Honedge": 1303, "Mon: Hoopa": 1304, "Mon: Hoopa-Unbound": 1305, "Mon: Hoothoot": 1306, "Mon: Hoppip": 1307, "Mon: Horsea": 1308, "Mon: Houndoom": 1309, "Mon: Houndoom-Mega": 1310, "Mon: Houndour": 1311, "Mon: Houndstone": 1312, "Mon: Huntail": 1313, "Mon: Hydrapple": 1314, "Mon: Hydreigon": 1315, "Mon: Hypno": 1316, "Mon: Igglybuff": 1317, "Mon: Illumise": 1318, "Mon: Impidimp": 1319, "Mon: Incineroar": 1320, "Mon: Indeedee": 1321, "Mon: Indeedee-F": 1322, "Mon: Infernape": 1323, "Mon: Inkay": 1324, "Mon: Inteleon": 1325, "Mon: Iron Boulder": 1326, "Mon: Iron Bundle": 1327, "Mon: Iron Crown": 1328, "Mon: Iron Hands": 1329, "Mon: Iron Jugulis": 1330, "Mon: Iron Leaves": 1331, "Mon: Iron Moth": 1332, "Mon: Iron Thorns": 1333, "Mon: Iron Treads": 1334, "Mon: Iron Valiant": 1335, "Mon: Ivysaur": 1336, "Mon: Jangmo-o": 1337, "Mon: Jellicent": 1338, "Mon: Jigglypuff": 1339, "Mon: Jirachi": 1340, "Mon: Jolteon": 1341, "Mon: Joltik": 1342, "Mon: Jumpluff": 1343, "Mon: Jynx": 1344, "Mon: Kabuto": 1345, "Mon: Kabutops": 1346, "Mon: Kadabra": 1347, "Mon: Kakuna": 1348, "Mon: Kangaskhan": 1349, "Mon: Kangaskhan-Mega": 1350, "Mon: Karrablast": 1351, "Mon: Kartana": 1352, "Mon: Kecleon": 1353, "Mon: Keldeo": 1354, "Mon: Kilowattrel": 1355, "Mon: Kingambit": 1356, "Mon: Kingdra": 1357, "Mon: Kingler": 1358, "Mon: Kirlia": 1359, "Mon: Klang": 1360, "Mon: Klawf": 1361, "Mon: Kleavor": 1362, "Mon: Klefki": 1363, "Mon: Klink": 1364, "Mon: Klinklang": 1365, "Mon: Koffing": 1366, "Mon: Komala": 1367, "Mon: Kommo-o": 1368, "Mon: Kommo-o-Totem": 1369, "Mon: Koraidon": 1370, "Mon: Krabby": 1371, "Mon: Kricketot": 1372, "Mon: Kricketune": 1373, "Mon: Krokorok": 1374, "Mon: Krookodile": 1375, "Mon: Kubfu": 1376, "Mon: Kyogre": 1377, "Mon: Kyogre-Primal": 1378, "Mon: Kyurem": 1379, "Mon: Kyurem-Black": 1380, "Mon: Kyurem-White": 1381, "Mon: Lairon": 1382, "Mon: Lampent": 1383, "Mon: Landorus": 1384, "Mon: Landorus-Therian": 1385, "Mon: Lanturn": 1386, "Mon: Lapras": 1387, "Mon: Larvesta": 1388, "Mon: Larvitar": 1389, "Mon: Latias": 1390, "Mon: Latias-Mega": 1391, "Mon: Latios": 1392, "Mon: Latios-Mega": 1393, "Mon: Leafeon": 1394, "Mon: Leavanny": 1395, "Mon: Lechonk": 1396, "Mon: Ledian": 1397, "Mon: Ledyba": 1398, "Mon: Lickilicky": 1399, "Mon: Lickitung": 1400, "Mon: Liepard": 1401, "Mon: Lileep": 1402, "Mon: Lilligant": 1403, "Mon: Lilligant-Hisui": 1404, "Mon: Lillipup": 1405, "Mon: Linoone": 1406, "Mon: Linoone-Galar": 1407, "Mon: Litleo": 1408, "Mon: Litten": 1409, "Mon: Litwick": 1410, "Mon: Lokix": 1411, "Mon: Lombre": 1412, "Mon: Lopunny": 1413, "Mon: Lopunny-Mega": 1414, "Mon: Lotad": 1415, "Mon: Loudred": 1416, "Mon: Lucario": 1417, "Mon: Lucario-Mega": 1418, "Mon: Ludicolo": 1419, "Mon: Lugia": 1420, "Mon: Lumineon": 1421, "Mon: Lunala": 1422, "Mon: Lunatone": 1423, "Mon: Lurantis": 1424, "Mon: Lurantis-Totem": 1425, "Mon: Luvdisc": 1426, "Mon: Luxio": 1427, "Mon: Luxray": 1428, "Mon: Lycanroc": 1429, "Mon: Lycanroc-Dusk": 1430, "Mon: Lycanroc-Midnight": 1431, "Mon: Mabosstiff": 1432, "Mon: Machamp": 1433, "Mon: Machoke": 1434, "Mon: Machop": 1435, "Mon: Magby": 1436, "Mon: Magcargo": 1437, "Mon: Magearna": 1438, "Mon: Magikarp": 1439, "Mon: Magmar": 1440, "Mon: Magmortar": 1441, "Mon: Magnemite": 1442, "Mon: Magneton": 1443, "Mon: Magnezone": 1444, "Mon: Makuhita": 1445, "Mon: Malamar": 1446, "Mon: Mamoswine": 1447, "Mon: Manaphy": 1448, "Mon: Mandibuzz": 1449, "Mon: Manectric": 1450, "Mon: Manectric-Mega": 1451, "Mon: Mankey": 1452, "Mon: Mantine": 1453, "Mon: Mantyke": 1454, "Mon: Maractus": 1455, "Mon: Mareanie": 1456, "Mon: Mareep": 1457, "Mon: Marill": 1458, "Mon: Marowak": 1459, "Mon: Marowak-Alola": 1460, "Mon: Marowak-Alola-Totem": 1461, "Mon: Marshadow": 1462, "Mon: Marshtomp": 1463, "Mon: Maschiff": 1464, "Mon: Masquerain": 1465, "Mon: Maushold": 1466, "Mon: Mawile": 1467, "Mon: Mawile-Mega": 1468, "Mon: Medicham": 1469, "Mon: Medicham-Mega": 1470, "Mon: Meditite": 1471, "Mon: Meganium": 1472, "Mon: Melmetal": 1473, "Mon: Meloetta": 1474, "Mon: Meltan": 1475, "Mon: Meowscarada": 1476, "Mon: Meowstic": 1477, "Mon: Meowth": 1478, "Mon: Meowth-Alola": 1479, "Mon: Meowth-Galar": 1480, "Mon: Mesprit": 1481, "Mon: Metagross": 1482, "Mon: Metagross-Mega": 1483, "Mon: Metang": 1484, "Mon: Metapod": 1485, "Mon: Mew": 1486, "Mon: Mewtwo": 1487, "Mon: Mewtwo-Mega-X": 1488, "Mon: Mewtwo-Mega-Y": 1489, "Mon: Mienfoo": 1490, "Mon: Mienshao": 1491, "Mon: Mightyena": 1492, "Mon: Milcery": 1493, "Mon: Milotic": 1494, "Mon: Miltank": 1495, "Mon: Mime Jr.": 1496, "Mon: Mimikyu": 1497, "Mon: Mimikyu-Busted": 1498, "Mon: Mimikyu-Totem": 1499, "Mon: Minccino": 1500, "Mon: Minior": 1501, "Mon: Minun": 1502, "Mon: Miraidon": 1503, "Mon: Misdreavus": 1504, "Mon: Mismagius": 1505, "Mon: Moltres": 1506, "Mon: Moltres-Galar": 1507, "Mon: Monferno": 1508, "Mon: Morelull": 1509, "Mon: Morgrem": 1510, "Mon: Morpeko": 1511, "Mon: Mothim": 1512, "Mon: Mr. Mime": 1513, "Mon: Mr. Mime-Galar": 1514, "Mon: Mr. Rime": 1515, "Mon: Mudbray": 1516, "Mon: Mudkip": 1517, "Mon: Mudsdale": 1518, "Mon: Muk": 1519, "Mon: Muk-Alola": 1520, "Mon: Munchlax": 1521, "Mon: Munkidori": 1522, "Mon: Munna": 1523, "Mon: Murkrow": 1524, "Mon: Musharna": 1525, "Mon: Nacli": 1526, "Mon: Naclstack": 1527, "Mon: Naganadel": 1528, "Mon: Natu": 1529, "Mon: Necrozma": 1530, "Mon: Necrozma-Dawn-Wings": 1531, "Mon: Necrozma-Dusk-Mane": 1532, "Mon: Nickit": 1533, "Mon: Nidoking": 1534, "Mon: Nidoqueen": 1535, "Mon: NidoranF": 1536, "Mon: NidoranM": 1537, "Mon: Nidorina": 1538, "Mon: Nidorino": 1539, "Mon: Nihilego": 1540, "Mon: Nincada": 1541, "Mon: Ninetales": 1542, "Mon: Ninetales-Alola": 1543, "Mon: Ninjask": 1544, "Mon: Noctowl": 1545, "Mon: Noibat": 1546, "Mon: Noivern": 1547, "Mon: Nosepass": 1548, "Mon: Numel": 1549, "Mon: Nuzleaf": 1550, "Mon: Nymble": 1551, "Mon: Obstagoon": 1552, "Mon: Octillery": 1553, "Mon: Oddish": 1554, "Mon: Ogerpon": 1555, "Mon: Ogerpon-Cornerstone": 1556, "Mon: Ogerpon-Hearthflame": 1557, "Mon: Ogerpon-Wellspring": 1558, "Mon: Oinkologne": 1559, "Mon: Oinkologne-F": 1560, "Mon: Okidogi": 1561, "Mon: Omanyte": 1562, "Mon: Omastar": 1563, "Mon: Onix": 1564, "Mon: Oranguru": 1565, "Mon: Orbeetle": 1566, "Mon: Oricorio": 1567, "Mon: Oricorio-Pa'u": 1568, "Mon: Oricorio-Pom-Pom": 1569, "Mon: Oricorio-Sensu": 1570, "Mon: Orthworm": 1571, "Mon: Oshawott": 1572, "Mon: Overqwil": 1573, "Mon: Pachirisu": 1574, "Mon: Palafin": 1575, "Mon: Palkia": 1576, "Mon: Palkia-Origin": 1577, "Mon: Palossand": 1578, "Mon: Palpitoad": 1579, "Mon: Pancham": 1580, "Mon: Pangoro": 1581, "Mon: Panpour": 1582, "Mon: Pansage": 1583, "Mon: Pansear": 1584, "Mon: Paras": 1585, "Mon: Parasect": 1586, "Mon: Passimian": 1587, "Mon: Patrat": 1588, "Mon: Pawmi": 1589, "Mon: Pawmo": 1590, "Mon: Pawmot": 1591, "Mon: Pawniard": 1592, "Mon: Pecharunt": 1593, "Mon: Pelipper": 1594, "Mon: Perrserker": 1595, "Mon: Persian": 1596, "Mon: Persian-Alola": 1597, "Mon: Petilil": 1598, "Mon: Phanpy": 1599, "Mon: Phantump": 1600, "Mon: Pheromosa": 1601, "Mon: Phione": 1602, "Mon: Pichu": 1603, "Mon: Pidgeot": 1604, "Mon: Pidgeot-Mega": 1605, "Mon: Pidgeotto": 1606, "Mon: Pidgey": 1607, "Mon: Pidove": 1608, "Mon: Pignite": 1609, "Mon: Pikachu": 1610, "Mon: Pikachu-Alola": 1611, "Mon: Pikachu-Hoenn": 1612, "Mon: Pikachu-Kalos": 1613, "Mon: Pikachu-Original": 1614, "Mon: Pikachu-Partner": 1615, "Mon: Pikachu-Sinnoh": 1616, "Mon: Pikachu-Unova": 1617, "Mon: Pikipek": 1618, "Mon: Piloswine": 1619, "Mon: Pincurchin": 1620, "Mon: Pineco": 1621, "Mon: Pinsir": 1622, "Mon: Pinsir-Mega": 1623, "Mon: Piplup": 1624, "Mon: Plusle": 1625, "Mon: Poipole": 1626, "Mon: Politoed": 1627, "Mon: Poliwag": 1628, "Mon: Poliwhirl": 1629, "Mon: Poliwrath": 1630, "Mon: Poltchageist": 1631, "Mon: Polteageist": 1632, "Mon: Ponyta": 1633, "Mon: Ponyta-Galar": 1634, "Mon: Poochyena": 1635, "Mon: Popplio": 1636, "Mon: Porygon": 1637, "Mon: Porygon-Z": 1638, "Mon: Porygon2": 1639, "Mon: Primarina": 1640, "Mon: Primeape": 1641, "Mon: Prinplup": 1642, "Mon: Probopass": 1643, "Mon: Psyduck": 1644, "Mon: Pumpkaboo": 1645, "Mon: Pumpkaboo-Large": 1646, "Mon: Pumpkaboo-Small": 1647, "Mon: Pumpkaboo-Super": 1648, "Mon: Pupitar": 1649, "Mon: Purrloin": 1650, "Mon: Purugly": 1651, "Mon: Pyroar": 1652, "Mon: Pyukumuku": 1653, "Mon: Quagsire": 1654, "Mon: Quaquaval": 1655, "Mon: Quaxly": 1656, "Mon: Quaxwell": 1657, "Mon: Quilava": 1658, "Mon: Quilladin": 1659, "Mon: Qwilfish": 1660, "Mon: Qwilfish-Hisui": 1661, "Mon: Raboot": 1662, "Mon: Rabsca": 1663, "Mon: Raging Bolt": 1664, "Mon: Raichu": 1665, "Mon: Raichu-Alola": 1666, "Mon: Raikou": 1667, "Mon: Ralts": 1668, "Mon: Rampardos": 1669, "Mon: Rapidash": 1670, "Mon: Rapidash-Galar": 1671, "Mon: Raticate": 1672, "Mon: Raticate-Alola": 1673, "Mon: Raticate-Alola-Totem": 1674, "Mon: Rattata": 1675, "Mon: Rattata-Alola": 1676, "Mon: Rayquaza": 1677, "Mon: Rayquaza-Mega": 1678, "Mon: Regice": 1679, "Mon: Regidrago": 1680, "Mon: Regieleki": 1681, "Mon: Regigigas": 1682, "Mon: Regirock": 1683, "Mon: Registeel": 1684, "Mon: Relicanth": 1685, "Mon: Rellor": 1686, "Mon: Remoraid": 1687, "Mon: Reshiram": 1688, "Mon: Reuniclus": 1689, "Mon: Revavroom": 1690, "Mon: Rhydon": 1691, "Mon: Rhyhorn": 1692, "Mon: Rhyperior": 1693, "Mon: Ribombee": 1694, "Mon: Ribombee-Totem": 1695, "Mon: Rillaboom": 1696, "Mon: Riolu": 1697, "Mon: Roaring Moon": 1698, "Mon: Rockruff": 1699, "Mon: Roggenrola": 1700, "Mon: Rolycoly": 1701, "Mon: Rookidee": 1702, "Mon: Roselia": 1703, "Mon: Roserade": 1704, "Mon: Rotom": 1705, "Mon: Rotom-Fan": 1706, "Mon: Rotom-Frost": 1707, "Mon: Rotom-Heat": 1708, "Mon: Rotom-Mow": 1709, "Mon: Rotom-Wash": 1710, "Mon: Rowlet": 1711, "Mon: Rufflet": 1712, "Mon: Runerigus": 1713, "Mon: Sableye": 1714, "Mon: Sableye-Mega": 1715, "Mon: Salamence": 1716, "Mon: Salamence-Mega": 1717, "Mon: Salandit": 1718, "Mon: Salazzle": 1719, "Mon: Salazzle-Totem": 1720, "Mon: Samurott": 1721, "Mon: Samurott-Hisui": 1722, "Mon: Sandaconda": 1723, "Mon: Sandile": 1724, "Mon: Sandshrew": 1725, "Mon: Sandshrew-Alola": 1726, "Mon: Sandslash": 1727, "Mon: Sandslash-Alola": 1728, "Mon: Sandy Shocks": 1729, "Mon: Sandygast": 1730, "Mon: Sawk": 1731, "Mon: Sawsbuck": 1732, "Mon: Scatterbug": 1733, "Mon: Sceptile": 1734, "Mon: Sceptile-Mega": 1735, "Mon: Scizor": 1736, "Mon: Scizor-Mega": 1737, "Mon: Scolipede": 1738, "Mon: Scorbunny": 1739, "Mon: Scovillain": 1740, "Mon: Scrafty": 1741, "Mon: Scraggy": 1742, "Mon: Scream Tail": 1743, "Mon: Scyther": 1744, "Mon: Seadra": 1745, "Mon: Seaking": 1746, "Mon: Sealeo": 1747, "Mon: Seedot": 1748, "Mon: Seel": 1749, "Mon: Seismitoad": 1750, "Mon: Sentret": 1751, "Mon: Serperior": 1752, "Mon: Servine": 1753, "Mon: Seviper": 1754, "Mon: Sewaddle": 1755, "Mon: Sharpedo": 1756, "Mon: Sharpedo-Mega": 1757, "Mon: Shaymin": 1758, "Mon: Shaymin-Sky": 1759, "Mon: Shedinja": 1760, "Mon: Shelgon": 1761, "Mon: Shellder": 1762, "Mon: Shellos": 1763, "Mon: Shelmet": 1764, "Mon: Shieldon": 1765, "Mon: Shiftry": 1766, "Mon: Shiinotic": 1767, "Mon: Shinx": 1768, "Mon: Shroodle": 1769, "Mon: Shroomish": 1770, "Mon: Shuckle": 1771, "Mon: Shuppet": 1772, "Mon: Sigilyph": 1773, "Mon: Silcoon": 1774, "Mon: Silicobra": 1775, "Mon: Silvally": 1776, "Mon: Silvally-Bug": 1777, "Mon: Silvally-Dark": 1778, "Mon: Silvally-Dragon": 1779, "Mon: Silvally-Electric": 1780, "Mon: Silvally-Fairy": 1781, "Mon: Silvally-Fighting": 1782, "Mon: Silvally-Fire": 1783, "Mon: Silvally-Flying": 1784, "Mon: Silvally-Ghost": 1785, "Mon: Silvally-Grass": 1786, "Mon: Silvally-Ground": 1787, "Mon: Silvally-Ice": 1788, "Mon: Silvally-Poison": 1789, "Mon: Silvally-Psychic": 1790, "Mon: Silvally-Rock": 1791, "Mon: Silvally-Steel": 1792, "Mon: Silvally-Water": 1793, "Mon: Simipour": 1794, "Mon: Simisage": 1795, "Mon: Simisear": 1796, "Mon: Sinistcha": 1797, "Mon: Sinistea": 1798, "Mon: Sirfetch'd": 1799, "Mon: Sizzlipede": 1800, "Mon: Skarmory": 1801, "Mon: Skeledirge": 1802, "Mon: Skiddo": 1803, "Mon: Skiploom": 1804, "Mon: Skitty": 1805, "Mon: Skorupi": 1806, "Mon: Skrelp": 1807, "Mon: Skuntank": 1808, "Mon: Skwovet": 1809, "Mon: Slaking": 1810, "Mon: Slakoth": 1811, "Mon: Sliggoo": 1812, "Mon: Sliggoo-Hisui": 1813, "Mon: Slither Wing": 1814, "Mon: Slowbro": 1815, "Mon: Slowbro-Galar": 1816, "Mon: Slowbro-Mega": 1817, "Mon: Slowking": 1818, "Mon: Slowking-Galar": 1819, "Mon: Slowpoke": 1820, "Mon: Slowpoke-Galar": 1821, "Mon: Slugma": 1822, "Mon: Slurpuff": 1823, "Mon: Smeargle": 1824, "Mon: Smoliv": 1825, "Mon: Smoochum": 1826, "Mon: Sneasel": 1827, "Mon: Sneasel-Hisui": 1828, "Mon: Sneasler": 1829, "Mon: Snivy": 1830, "Mon: Snom": 1831, "Mon: Snorlax": 1832, "Mon: Snorunt": 1833, "Mon: Snover": 1834, "Mon: Snubbull": 1835, "Mon: Sobble": 1836, "Mon: Solgaleo": 1837, "Mon: Solosis": 1838, "Mon: Solrock": 1839, "Mon: Spearow": 1840, "Mon: Spectrier": 1841, "Mon: Spewpa": 1842, "Mon: Spheal": 1843, "Mon: Spidops": 1844, "Mon: Spinarak": 1845, "Mon: Spinda": 1846, "Mon: Spiritomb": 1847, "Mon: Spoink": 1848, "Mon: Sprigatito": 1849, "Mon: Spritzee": 1850, "Mon: Squawkabilly": 1851, "Mon: Squirtle": 1852, "Mon: Stakataka": 1853, "Mon: Stantler": 1854, "Mon: Staraptor": 1855, "Mon: Staravia": 1856, "Mon: Starly": 1857, "Mon: Starmie": 1858, "Mon: Staryu": 1859, "Mon: Steelix": 1860, "Mon: Steelix-Mega": 1861, "Mon: Steenee": 1862, "Mon: Stonjourner": 1863, "Mon: Stoutland": 1864, "Mon: Stufful": 1865, "Mon: Stunfisk": 1866, "Mon: Stunfisk-Galar": 1867, "Mon: Stunky": 1868, "Mon: Sudowoodo": 1869, "Mon: Suicune": 1870, "Mon: Sunflora": 1871, "Mon: Sunkern": 1872, "Mon: Surskit": 1873, "Mon: Swablu": 1874, "Mon: Swadloon": 1875, "Mon: Swalot": 1876, "Mon: Swampert": 1877, "Mon: Swampert-Mega": 1878, "Mon: Swanna": 1879, "Mon: Swellow": 1880, "Mon: Swinub": 1881, "Mon: Swirlix": 1882, "Mon: Swoobat": 1883, "Mon: Sylveon": 1884, "Mon: Taillow": 1885, "Mon: Talonflame": 1886, "Mon: Tandemaus": 1887, "Mon: Tangela": 1888, "Mon: Tangrowth": 1889, "Mon: Tapu Bulu": 1890, "Mon: Tapu Fini": 1891, "Mon: Tapu Koko": 1892, "Mon: Tapu Lele": 1893, "Mon: Tarountula": 1894, "Mon: Tatsugiri": 1895, "Mon: Tauros": 1896, "Mon: Tauros-Paldea": 1897, "Mon: Tauros-Paldea-Aqua": 1898, "Mon: Tauros-Paldea-Blaze": 1899, "Mon: Tauros-Paldea-Combat": 1900, "Mon: Tauros-Paldea-Fire": 1901, "Mon: Tauros-Paldea-Water": 1902, "Mon: Teddiursa": 1903, "Mon: Tentacool": 1904, "Mon: Tentacruel": 1905, "Mon: Tepig": 1906, "Mon: Terapagos": 1907, "Mon: Terrakion": 1908, "Mon: Thievul": 1909, "Mon: Throh": 1910, "Mon: Thundurus": 1911, "Mon: Thundurus-Therian": 1912, "Mon: Thwackey": 1913, "Mon: Timburr": 1914, "Mon: Ting-Lu": 1915, "Mon: Tinkatink": 1916, "Mon: Tinkaton": 1917, "Mon: Tinkatuff": 1918, "Mon: Tirtouga": 1919, "Mon: Toedscool": 1920, "Mon: Toedscruel": 1921, "Mon: Togedemaru": 1922, "Mon: Togedemaru-Totem": 1923, "Mon: Togekiss": 1924, "Mon: Togepi": 1925, "Mon: Togetic": 1926, "Mon: Torchic": 1927, "Mon: Torkoal": 1928, "Mon: Tornadus": 1929, "Mon: Tornadus-Therian": 1930, "Mon: Torracat": 1931, "Mon: Torterra": 1932, "Mon: Totodile": 1933, "Mon: Toucannon": 1934, "Mon: Toxapex": 1935, "Mon: Toxel": 1936, "Mon: Toxicroak": 1937, "Mon: Toxtricity": 1938, "Mon: Tranquill": 1939, "Mon: Trapinch": 1940, "Mon: Treecko": 1941, "Mon: Trevenant": 1942, "Mon: Tropius": 1943, "Mon: Trubbish": 1944, "Mon: Trumbeak": 1945, "Mon: Tsareena": 1946, "Mon: Turtonator": 1947, "Mon: Turtwig": 1948, "Mon: Tympole": 1949, "Mon: Tynamo": 1950, "Mon: Type: Null": 1951, "Mon: Typhlosion": 1952, "Mon: Typhlosion-Hisui": 1953, "Mon: Tyranitar": 1954, "Mon: Tyranitar-Mega": 1955, "Mon: Tyrantrum": 1956, "Mon: Tyrogue": 1957, "Mon: Tyrunt": 1958, "Mon: Umbreon": 1959, "Mon: Unfezant": 1960, "Mon: Unown": 1961, "Mon: Ursaluna": 1962, "Mon: Ursaluna-Bloodmoon": 1963, "Mon: Ursaring": 1964, "Mon: Urshifu": 1965, "Mon: Urshifu-Rapid-Strike": 1966, "Mon: Uxie": 1967, "Mon: Vanillish": 1968, "Mon: Vanillite": 1969, "Mon: Vanilluxe": 1970, "Mon: Vaporeon": 1971, "Mon: Varoom": 1972, "Mon: Veluza": 1973, "Mon: Venipede": 1974, "Mon: Venomoth": 1975, "Mon: Venonat": 1976, "Mon: Venusaur": 1977, "Mon: Venusaur-Gmax": 1978, "Mon: Venusaur-Mega": 1979, "Mon: Vespiquen": 1980, "Mon: Vibrava": 1981, "Mon: Victini": 1982, "Mon: Victreebel": 1983, "Mon: Vigoroth": 1984, "Mon: Vikavolt": 1985, "Mon: Vikavolt-Totem": 1986, "Mon: Vileplume": 1987, "Mon: Virizion": 1988, "Mon: Vivillon": 1989, "Mon: Volbeat": 1990, "Mon: Volcanion": 1991, "Mon: Volcarona": 1992, "Mon: Voltorb": 1993, "Mon: Voltorb-Hisui": 1994, "Mon: Vullaby": 1995, "Mon: Vulpix": 1996, "Mon: Vulpix-Alola": 1997, "Mon: Wailmer": 1998, "Mon: Wailord": 1999, "Mon: Walking Wake": 2000, "Mon: Walrein": 2001, "Mon: Wartortle": 2002, "Mon: Watchog": 2003, "Mon: Wattrel": 2004, "Mon: Weavile": 2005, "Mon: Weedle": 2006, "Mon: Weepinbell": 2007, "Mon: Weezing": 2008, "Mon: Weezing-Galar": 2009, "Mon: Whimsicott": 2010, "Mon: Whirlipede": 2011, "Mon: Whiscash": 2012, "Mon: Whismur": 2013, "Mon: Wigglytuff": 2014, "Mon: Wiglett": 2015, "Mon: Wimpod": 2016, "Mon: Wingull": 2017, "Mon: Wishiwashi": 2018, "Mon: Wishiwashi-School": 2019, "Mon: Wo-Chien": 2020, "Mon: Wobbuffet": 2021, "Mon: Woobat": 2022, "Mon: Wooloo": 2023, "Mon: Wooper": 2024, "Mon: Wooper-Paldea": 2025, "Mon: Wormadam": 2026, "Mon: Wormadam-Sandy": 2027, "Mon: Wormadam-Trash": 2028, "Mon: Wugtrio": 2029,